{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|bach|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|mozart|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "<\\|[^|]+\\|>|\\[[^\\]]+\\]|![^!]+!|[a-zA-Z]|\\d|\\||\\^|_|=|,|'|\\/|\\(|\\)|-"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|unk|>": 1,
      "<|bos|>": 2,
      "<|eos|>": 3,
      "<|bach|>": 4,
      "<|mozart|>": 5,
      "!": 6,
      "'": 7,
      "(": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "<": 24,
      "=": 25,
      ">": 26,
      "A": 27,
      "B": 28,
      "C": 29,
      "D": 30,
      "E": 31,
      "F": 32,
      "G": 33,
      "K": 34,
      "L": 35,
      "M": 36,
      "P": 37,
      "S": 38,
      "V": 39,
      "[": 40,
      "]": 41,
      "^": 42,
      "_": 43,
      "a": 44,
      "b": 45,
      "c": 46,
      "d": 47,
      "e": 48,
      "f": 49,
      "g": 50,
      "h": 51,
      "i": 52,
      "l": 53,
      "m": 54,
      "n": 55,
      "o": 56,
      "p": 57,
      "r": 58,
      "s": 59,
      "t": 60,
      "u": 61,
      "w": 62,
      "x": 63,
      "z": 64,
      "|": 65,
      "V:": 66,
      "[V:": 67,
      "fe": 68,
      "!fe": 69,
      "a!": 70,
      "at": 71,
      "mat": 72,
      "rmat": 73,
      "!fermat": 74,
      "!fermata!": 75,
      "4]": 76,
      "[V:1": 77,
      "[V:2": 78,
      "[V:3": 79,
      "[V:1]": 80,
      "[V:2]": 81,
      "[V:3]": 82,
      "[V:4]": 83,
      "le": 84,
      "cle": 85,
      "f=": 86,
      "clef=": 87,
      "<|": 88,
      "|>": 89,
      "ble": 90,
      "eble": 91,
      "reble": 92,
      "treble": 93,
      "clef=treble": 94,
      "os": 95,
      "<|b": 96,
      "os|>": 97,
      "clef=treble]": 98,
      "K:": 99,
      "[K:": 100,
      "C]": 101,
      "8]": 102,
      ",]": 103,
      "M:": 104,
      "[M:": 105,
      "ac": 106,
      "eos|>": 107,
      "h|>": 108,
      "<|bac": 109,
      "1/": 110,
      ":1/": 111,
      "L:1/": 112,
      "[L:1/": 113,
      "ba": 114,
      "s]": 115,
      "ss]": 116,
      "bass]": 117,
      "-8]": 118,
      "4clef=": 119,
      "[V:4clef=": 120,
      "[V:1clef=treble]": 121,
      "[V:2clef=treble]": 122,
      "[V:3clef=treble": 123,
      "[V:4clef=bass]": 124,
      "[V:3clef=treble-8]": 125,
      ",-": 126,
      "[M:C]": 127,
      "[L:1/4]": 128,
      "A,": 129,
      ",-]": 130,
      "G]": 131,
      "[K:C]": 132,
      "B,": 133,
      "G,": 134,
      "[L:1/8]": 135,
      "[C": 136,
      "/4]": 137,
      "[^": 138,
      "[D": 139,
      "F]": 140,
      "[K:G]": 141,
      "A]": 142,
      "b]": 143,
      "D,]": 144,
      ",A,": 145,
      "D]": 146,
      "[M:3": 147,
      "[e": 148,
      "[C,": 149,
      "[E": 150,
      "[M:3/4]": 151,
      ",D,]": 152,
      "-]": 153,
      "d]": 154,
      "[F": 155,
      "B,,]": 156,
      "[A,": 157,
      "[c": 158,
      "[K:B": 159,
      ",A,,]": 160,
      "[G,": 161,
      "[K:Bb]": 162,
      "[A": 163,
      "[B": 164,
      "[d": 165,
      "[K:F]": 166,
      "[B,": 167,
      "[K:D]": 168,
      "C,]": 169,
      "[M:4": 170,
      "[M:4/4]": 171,
      "[ed]": 172,
      "[G": 173,
      "[D,D,]": 174,
      "[g": 175,
      "G,,-]": 176,
      "[C,C,]": 177,
      "E]": 178,
      "B]": 179,
      "G,,]": 180,
      "[=": 181,
      "[K:A]": 182,
      "F,]": 183,
      "G,]": 184,
      ",-G,,-]": 185,
      "[^A,": 186,
      "[C,B,,]": 187,
      "[AG]": 188,
      ",G,,]": 189,
      "c]": 190,
      "[^A,,A,,]": 191,
      "[BA]": 192,
      "A,]": 193,
      "B,]": 194,
      "B,,-]": 195,
      ",,]": 196,
      "[K:E": 197,
      "[F,": 198,
      "[K:Eb]": 199,
      "E,]": 200,
      "f]": 201,
      ",-C": 202,
      ",,-]": 203,
      ",A,,-]": 204,
      ",B,,]": 205,
      "[f": 206,
      "[^c": 207,
      "D,D,]": 208,
      "A,,-]": 209,
      "[cB]": 210,
      "AF]": 211,
      "[ba": 212,
      "[^d": 213,
      "[dc]": 214,
      "[ba]": 215,
      "G,-]": 216,
      ",-D": 217,
      "[A,,A,,]": 218,
      "-^": 219,
      "=d]": 220,
      "BG]": 221,
      "[fe": 222,
      "[K:E]": 223,
      "[GF]": 224,
      "G-]": 225,
      "[E,": 226,
      "[G,F,]": 227,
      "[dAF]": 228,
      "[gf]": 229,
      "16": 230,
      "GE]": 231,
      ",-A,": 232,
      "[^D,D,]": 233,
      "[eBG]": 234,
      "[A,G,]": 235,
      "[G,,G,,]": 236,
      "[=A,": 237,
      "[fe]": 238,
      "/8]": 239,
      "D,-]": 240,
      ",-B,,]": 241,
      "[C-": 242,
      "[ED]": 243,
      "[C,-C": 244,
      "[^F": 245,
      "[D,": 246,
      "[D,-G,,-]": 247,
      "[F,-": 248,
      "[g-": 249,
      "[^d=d]": 250,
      ",-D,,-]": 251,
      "A-]": 252,
      "B-]": 253,
      "C-]": 254,
      "E,-]": 255,
      "[_": 256,
      "dB]": 257,
      "[c-": 258,
      "[cGE]": 259,
      "[cB-]": 260,
      "16]": 261,
      ",G,,-]": 262,
      "=A]": 263,
      "D,-G,,-]": 264,
      "E,,]": 265,
      "F-]": 266,
      "[CB,": 267,
      "[^D": 268,
      "[^G,": 269,
      "[D-": 270,
      "[DB,]": 271,
      "[E,B,,]": 272,
      "[G,,-G,,-]": 273,
      "[d-": 274,
      "[B,,B,,]": 275,
      "[gdB]": 276,
      "[=D,D,]": 277,
      "[C,-C,-]": 278,
      "[g-f]": 279,
      "[c-B]": 280,
      ",D": 281,
      "B,-]": 282,
      "cG]": 283,
      "c-]": 284,
      "f-]": 285,
      "[L:1/16]": 286,
      ",-B,": 287,
      "[^A": 288,
      "[^C": 289,
      "[DC]": 290,
      "[e-": 291,
      "[c'": 292,
      "[B,A,]": 293,
      "[gf-]": 294,
      "C,-]": 295,
      "D-]": 296,
      "D,G,,]": 297,
      "F,-]": 298,
      "F,-A,": 299,
      "[a": 300,
      "d-]": 301,
      "g]": 302,
      ",-G,,]": 303,
      "[CF,]": 304,
      "[^G": 305,
      "[ecG]": 306,
      "[E,A,,-]": 307,
      "[F-": 308,
      "[A,=": 309,
      "[A,,-D,,-]": 310,
      "[G,B,,-]": 311,
      "[G,A,,-]": 312,
      "[A-": 313,
      "[BG]": 314,
      "[GB,]": 315,
      "[ge": 316,
      ",-C,,-]": 317,
      "[f-": 318,
      "[_D": 319,
      "[CB,D,-G,,-]": 320,
      ",D,,]": 321,
      ",E,,]": 322,
      "=D]": 323,
      "CA,]": 324,
      "DB,]": 325,
      "E,A,,]": 326,
      "FD]": 327,
      "G,-": 328,
      "^D]": 329,
      "cA]": 330,
      ",-A,,-]": 331,
      "A,,]": 332,
      "[CG,]": 333,
      "[CB,]": 334,
      "[CB,-]": 335,
      "[D,A,,-]": 336,
      "[DG,-]": 337,
      "[M:3/8]": 338,
      "[E-": 339,
      "[EG,]": 340,
      "[FE]": 341,
      "[FCA,]": 342,
      "[B-": 343,
      "[B,F,]": 344,
      "[G-": 345,
      "[GDB,]": 346,
      "[F,B,,-]": 347,
      "[F,E,]": 348,
      "[fcA]": 349,
      "[^cB]": 350,
      "[c'b]": 351,
      "[A-G]": 352,
      ",C": 353,
      "=c]": 354,
      "=A,,-]": 355,
      "A,-]": 356,
      "Ab]": 357,
      "E-]": 358,
      "E,G,,]": 359,
      "F,,]": 360,
      "F,-B,,]": 361,
      "[b": 362,
      "^G": 363,
      "^D,]": 364,
      "[K:Ab]": 365,
      "[M:9": 366,
      ",A,,D,,]": 367,
      "[E,D,]": 368,
      "[EF,]": 369,
      "[FA,]": 370,
      "[A,G,-]": 371,
      "[cG]": 372,
      "[G,G,,]": 373,
      "[G,E,]": 374,
      "[AC]": 375,
      "[B,-": 376,
      "[dB": 377,
      "[dc-]": 378,
      "[B,D,G,,]": 379,
      "[B,E,G,,]": 380,
      "[GF-]": 381,
      "[=D": 382,
      "[=F": 383,
      "[^A,=": 384,
      "[F,E,-]": 385,
      "[=A,,A,,]": 386,
      "[=A,,-A,,-]": 387,
      "[C-F,-A,": 388,
      "[^FE]": 389,
      "[F,-B,,-]": 390,
      "[^C,A,,-]": 391,
      "[ag]": 392,
      "[^G=": 393,
      "[F-E]": 394,
      "[geB]": 395,
      "[_D-": 396,
      "[G-F]": 397,
      ",^": 398,
      "12": 399,
      "2]": 400,
      "=F]": 401,
      "=C-]": 402,
      "F,,-]": 403,
      "Pr": 404,
      "^G]": 405,
      "^A]": 406,
      "^G,]": 407,
      "^c]": 408,
      "am": 409,
      "dA]": 410,
      "gr": 411,
      "ogr": 412,
      "[M:6": 413,
      "[M:12": 414,
      ",-D,]": 415,
      "A,F,]": 416,
      "[DF,]": 417,
      "[DA,F,]": 418,
      "[e^": 419,
      "[E,A,,]": 420,
      "[F,D,]": 421,
      "[FE-]": 422,
      "[A,F,]": 423,
      "[A,,G,,]": 424,
      "[A,B,,-]": 425,
      "[A,A,,-]": 426,
      "[c-^": 427,
      "[A=A]": 428,
      "[dG]": 429,
      "[B,G,]": 430,
      "[B,B,,-]": 431,
      "[gd]": 432,
      "[F,D,-]": 433,
      "[fdA]": 434,
      "[^c=c]": 435,
      "[^dAF]": 436,
      "[D-C]": 437,
      "[d-A]": 438,
      "[e-d]": 439,
      "[B-A]": 440,
      "[^A,=A,]": 441,
      "[^G=G]": 442,
      "Progr": 443,
      "am16": 444,
      "[M:12/8]": 445,
      "Program16": 446,
      ",=": 447,
      ",F,,]": 448,
      "-a": 449,
      "-b]": 450,
      "-g]": 451,
      "/16]": 452,
      "/2]": 453,
      "=G,]": 454,
      "=E,]": 455,
      "=F-]": 456,
      "=D-]": 457,
      "=A,,]": 458,
      "AE]": 459,
      "C,,]": 460,
      "C,-G,,]": 461,
      "DA,]": 462,
      "DG,-]": 463,
      "D,-G,,]": 464,
      "E,-G,,-]": 465,
      "EB,]": 466,
      "E,B,,]": 467,
      "F,A,,D,,]": 468,
      "F,^": 469,
      "G,-A,": 470,
      "^A-]": 471,
      "^c-]": 472,
      "^D-]": 473,
      "e]": 474,
      "ge": 475,
      "fe]": 476,
      ",-C,]": 477,
      ",-F,,]": 478,
      ",-F,,-]": 479,
      "B,,G,,]": 480,
      "B,,E,,]": 481,
      "G,D,]": 482,
      "G,E,]": 483,
      "G,,-C,,-]": 484,
      "G,,C": 485,
      "[CC]": 486,
      "[CD,]": 487,
      "[CG,,-]": 488,
      "[C-^": 489,
      "[CE,-]": 490,
      "[CE,A,,]": 491,
      "[CE,-G,,-]": 492,
      "[CF,A,,D,,]": 493,
      "[C,-F,,-]": 494,
      "[^a": 495,
      "[D,A,,]": 496,
      "[D,G,,]": 497,
      "[D,B,,]": 498,
      "[D,-B,,]": 499,
      "[DC-]": 500,
      "[D,-B,": 501,
      "[DF,-]": 502,
      "[D=C-]": 503,
      "[D,-C,]": 504,
      "[ec]": 505,
      "[eA-]": 506,
      "[ed-]": 507,
      "[C,B,,-]": 508,
      "[C,C,,]": 509,
      "[E,-G,,-]": 510,
      "[E,G,,]": 511,
      "[EG,-]": 512,
      "[E-^": 513,
      "[E,-A,": 514,
      "[E,-B,": 515,
      "[EF,-A,": 516,
      "[E,-C,,-]": 517,
      "[E^D]": 518,
      "[E,-D,]": 519,
      "[EDG,-]": 520,
      "[F,A,,]": 521,
      "[F,A,,-]": 522,
      "[F,-A,": 523,
      "[F,A,,D,,]": 524,
      "[FDA,]": 525,
      "[A,B,,]": 526,
      "[A,C,]": 527,
      "[A,D,-]": 528,
      "[A,E,,]": 529,
      "[A,,D,,]": 530,
      "[A,^G,]": 531,
      "[A,B,,E,,]": 532,
      "[cAE]": 533,
      "[c^A-]": 534,
      "[K:B]": 535,
      "[G,D,]": 536,
      "[G,C,-]": 537,
      "[G,F,-]": 538,
      "[G,,F,,]": 539,
      "[A,-": 540,
      "[A,-C": 541,
      "[AG-]": 542,
      "[A,-B,,]": 543,
      "[A,-B,": 544,
      "[B,-B,,]": 545,
      "[BA-]": 546,
      "[B,-G,,]": 547,
      "[BFD]": 548,
      "[dE]": 549,
      "[d=d]": 550,
      "[dBG]": 551,
      "[dG-]": 552,
      "[B,D,]": 553,
      "[B,,A,,]": 554,
      "[B,C,]": 555,
      "[B,,-G,,-]": 556,
      "[B,,G,,]": 557,
      "[B,E,]": 558,
      "[B,D,-]": 559,
      "[B,E,-]": 560,
      "[B,,G,,-]": 561,
      "[B,D,-G,,-]": 562,
      "[B,C,-]": 563,
      "[G,-G,,-]": 564,
      "[G,-C": 565,
      "[G,-D": 566,
      "[G=F]": 567,
      "[GEB,]": 568,
      "[=A": 569,
      "[=C": 570,
      "[=c": 571,
      "[=f": 572,
      "[=E,B,,]": 573,
      "[F,G,,-]": 574,
      "[F,G,,-C,,-]": 575,
      ",-C,,]": 576,
      ",-C,G,,-]": 577,
      "[f^": 578,
      "[fd-]": 579,
      "[^c-": 580,
      "[^cG]": 581,
      "[^cc]": 582,
      "[^cGE]": 583,
      "[^c^G": 584,
      "[^c^A]": 585,
      ",-D,,]": 586,
      "[fe-]": 587,
      "[E,E,]": 588,
      "[E,C,-]": 589,
      "[E,^D,]": 590,
      "[E,=A,,]": 591,
      "[E,G,,C": 592,
      "[=A,,-C,,-]": 593,
      "[C-E,]": 594,
      "[C-D,-G,,]": 595,
      "[C-G,-A,": 596,
      "[C,-C,,-]": 597,
      "[^F,A,,-]": 598,
      "[D,C,]": 599,
      "[D,B,,-]": 600,
      "[D,C,-G,,]": 601,
      "[D,B,,G,,]": 602,
      "[F,-E,]": 603,
      "[F,-A,,-]": 604,
      "[F,-=A,,-]": 605,
      "[_G,-": 606,
      "[CB,D,G,,]": 607,
      "[^D=D]": 608,
      "[^D,=": 609,
      "[^D=D-]": 610,
      "[D-F,-B,,]": 611,
      "[d-=d]": 612,
      "[^AG-]": 613,
      "[^A=A]": 614,
      "[c'-b]": 615,
      "[a-g]": 616,
      "[A,=B,,]": 617,
      "[f-d]": 618,
      "[f-e]": 619,
      "[_D=E,]": 620,
      "G,-C,]": 621,
      "[E-F,-B,,]": 622,
      "[E-G,-C,]": 623,
      "[B-G-]": 624,
      ",C,,-]": 625,
      "[b-a": 626,
      "^GFD]": 627,
      "[M:9/8]": 628,
      "[M:9/16]": 629,
      "[B,-A,]": 630,
      "[dBF]": 631,
      "[=D,G,,-]": 632,
      "[=D,-C,G,,-]": 633,
      "[=F,D,]": 634,
      "[C-F,-A,,]": 635,
      "[C-F,-A,,-D,,-]": 636,
      "[_D-E,]": 637,
      "[_D-E,A,,]": 638,
      "[M:6/4]": 639,
      "[c-^G-]": 640,
      "[C-^A,]": 641,
      "[D,-B,,-G,,-]": 642,
      "[E,-A,,C,,-]": 643,
      "[E,-B,,-C,,]": 644,
      "[EF,-A,,]": 645,
      "[F,-A,,-D,,-]": 646,
      "[A,-C,-F,,]": 647,
      "[A,-B,,E,,]": 648,
      "[G,-C,-]": 649,
      "[G,-D,-]": 650,
      "[E,G,,C,,]": 651,
      "[C-G,-A,,]": 652,
      "[_G,-=A,,-]": 653,
      "[b-a]": 654,
      ",2": 655,
      ",B,,-]": 656,
      ",E,]": 657,
      ",2]": 658,
      "-E": 659,
      "-G": 660,
      "-d]": 661,
      "-E]": 662,
      "-G-]": 663,
      "-B,-]": 664,
      "-E-]": 665,
      "1[V:2]": 666,
      "2[V:2]": 667,
      "=A": 668,
      "=a": 669,
      "=C]": 670,
      "=D,]": 671,
      "=F,]": 672,
      "=G,-]": 673,
      "=A-]": 674,
      "=c-]": 675,
      "=F,-]": 676,
      "=E,A,,]": 677,
      "A^": 678,
      "B,-G,,-]": 679,
      "BG-]": 680,
      "B-G-]": 681,
      "C,G,,-]": 682,
      "Db]": 683,
      "D,G,,-]": 684,
      "E,A,,-]": 685,
      "E,2]": 686,
      "E-E]": 687,
      "F,D,]": 688,
      "F-^": 689,
      "F,D": 690,
      "GF]": 691,
      "GD]": 692,
      "G,-D": 693,
      "G,-B,": 694,
      "G^D]": 695,
      "[1[V:2]": 696,
      "[2[V:2]": 697,
      "^g": 698,
      "^C,]": 699,
      "^A,]": 700,
      "^D,-]": 701,
      "^C-]": 702,
      "^F-]": 703,
      "^F,-]": 704,
      "^G,-": 705,
      "^A,-]": 706,
      "^F,^": 707,
      "^F,D,]": 708,
      "_G]": 709,
      "_D,]": 710,
      "_G,]": 711,
      "_A,]": 712,
      "do": 713,
      "er": 714,
      "eBG-]": 715,
      "fd]": 716,
      "m]": 717,
      "mer": 718,
      "n]": 719,
      "p]": 720,
      "up]": 721,
      "wn]": 722,
      "fe-]": 723,
      "[V:1Program16": 724,
      "[V:2Program16": 725,
      "[V:3Program16": 726,
      "[K:Db]": 727,
      ",-B,,-]": 728,
      ",-^D,]": 729,
      ",-E,A,,-]": 730,
      "B,G,,]": 731,
      "B,=E,A,,]": 732,
      "G,B,,]": 733,
      "G,A,,]": 734,
      "G,_D,]": 735,
      "[CA,]": 736,
      "[C,A,,-]": 737,
      "[CD,-]": 738,
      "[C,-B,,]": 739,
      "[CA,-]": 740,
      "[CG,E,]": 741,
      "[C^A,-]": 742,
      "[C_G,]": 743,
      "[^GE]": 744,
      "[^fe]": 745,
      "[DG,]": 746,
      "[DE,-]": 747,
      "[D=D]": 748,
      "[DG,B,,]": 749,
      "[M:3/2]": 750,
      "[eF]": 751,
      "[e-^": 752,
      "[ED-]": 753,
      "[EA,-]": 754,
      "[E^D-]": 755,
      "[E,-^D,]": 756,
      "[FB,]": 757,
      "[F,-D": 758,
      "[FD-]": 759,
      "[F^D]": 760,
      "[F^D-]": 761,
      "[FE-E]": 762,
      "[A,A,,]": 763,
      "[A,^F,D,]": 764,
      "[cA]": 765,
      "[cD]": 766,
      "[cE]": 767,
      "[cc]": 768,
      "[cAF]": 769,
      "[c=A]": 770,
      "[G,A,,]": 771,
      "[G,F,^": 772,
      "[G,=F,-]": 773,
      "[G,^F,^": 774,
      "[A-^": 775,
      "[AC-]": 776,
      "[AFD]": 777,
      "[A^G]": 778,
      "[A=A-]": 779,
      "[A_G]": 780,
      "[BD]": 781,
      "[BE]": 782,
      "[BB,]": 783,
      "[B-^": 784,
      "[B^A]": 785,
      "[B^GFD]": 786,
      "[BF-^": 787,
      "[BGD]": 788,
      "[dB]": 789,
      "[d^c]": 790,
      "[d^c-]": 791,
      "[d=A": 792,
      "[dA^": 793,
      "[B,,A,,-]": 794,
      "[B,,E,,]": 795,
      "[B,=G,]": 796,
      "[B,^G,-": 797,
      "[M:4/2]": 798,
      "[GG]": 799,
      "[GD]": 800,
      "[GG,]": 801,
      "[G^D]": 802,
      "[G,-D,]": 803,
      "[G=F-]": 804,
      "[G^F-]": 805,
      "[GB,G,,]": 806,
      "[gG]": 807,
      "[g-^": 808,
      "[=fe]": 809,
      "[=GF]": 810,
      "[=fe-]": 811,
      "[=B,=E,A,,]": 812,
      "[^A,G,-]": 813,
      "[K:Em]": 814,
      "[F,F,]": 815,
      "[F,^D,]": 816,
      "[F,=F,]": 817,
      "[F,^D,-]": 818,
      "[fG]": 819,
      "[ff]": 820,
      "[f-^": 821,
      "[^c=c-]": 822,
      "[^dF]": 823,
      "[^d^G]": 824,
      "[^d^c-]": 825,
      "[^d-d]": 826,
      "-^F]": 827,
      "[E,D,-]": 828,
      "[E,,2": 829,
      "[E,,-B,,-]": 830,
      "[=A,G,]": 831,
      "[=A,G,D,]": 832,
      "[C-=C]": 833,
      "[^F=D]": 834,
      "[^F=F-]": 835,
      "[^F,B,,-]": 836,
      "[^F^C-]": 837,
      "[D,=D,]": 838,
      "[D,^C,]": 839,
      "[g-d]": 840,
      "[g-eBG-]": 841,
      "[_G,-D": 842,
      "[c-c]": 843,
      "[^DC]": 844,
      "[^D-B,-]": 845,
      "[^G,G,]": 846,
      "[^G,,G,,]": 847,
      "[^G,B,,-]": 848,
      "[^G,E,,]": 849,
      "[^G,,^": 850,
      "[^G,=G,]": 851,
      "[^G,=G,-]": 852,
      "[^G,^F,-]": 853,
      "[D-=D]": 854,
      "[D-G,-B,": 855,
      "[D-_A,]": 856,
      "[d-G]": 857,
      "[d-F]": 858,
      "[d-c]": 859,
      "[^AG]": 860,
      "[^AA]": 861,
      "[^A-G": 862,
      "[^CC]": 863,
      "[^C=C-]": 864,
      "[^CG,E,]": 865,
      "[e-G]": 866,
      "[e-A-]": 867,
      "[e-=A]": 868,
      "[e-B-G-]": 869,
      "[^GF]": 870,
      "[^GC-]": 871,
      "[F-C]": 872,
      "[F-D]": 873,
      "[A,=G,]": 874,
      "[A,=A,]": 875,
      "[A,=G,-]": 876,
      "[A,=G,A,,]": 877,
      "[A-=A]": 878,
      "[ge]": 879,
      "[ge^c]": 880,
      "[f-A]": 881,
      "[f-c]": 882,
      "[E-G,D,]": 883,
      "[G-B,-G,,-]": 884,
      "[bf]": 885,
      "[b^g": 886,
      "[B,-^A,]": 887,
      "[B,-G,_D,]": 888,
      "[dB=F]": 889,
      "[dB^GFD]": 890,
      "[=F,A,,-]": 891,
      "[=F,E,]": 892,
      "[^A,=A,-]": 893,
      "[^G=G-]": 894,
      "[M:6/8]": 895,
      "[e^d]": 896,
      "[e^cG]": 897,
      "[e^d-]": 898,
      "[c-^A]": 899,
      "ge^c]": 900,
      "gedo": 901,
      "[^a=a": 902,
      "[^age^c]": 903,
      "[E-^D]": 904,
      "[E-^C-]": 905,
      "[A,-G,]": 906,
      "[A,-^G,]": 907,
      "[=AG]": 908,
      "[=A,-E,A,,-]": 909,
      "[=C,B,,]": 910,
      "[=CB,-]": 911,
      "[=cG^D]": 912,
      "[=c-^F]": 913,
      "[=fdB]": 914,
      "[=f^G]": 915,
      "[f^d]": 916,
      "[f^d-]": 917,
      "[^c-A-]": 918,
      "[^c-=c]": 919,
      "[^c^GC]": 920,
      "[^c^GF]": 921,
      "[^D,=D,]": 922,
      "[^D,=D,-]": 923,
      "-EC]": 924,
      "F,D,A,,]": 925,
      "mergedo": 926,
      "[V:1Program16up]": 927,
      "[V:2Program16mergedo": 928,
      "[V:3Program16bass]": 929,
      "[e-^d]": 930,
      "[F,-D,-A,,-]": 931,
      "[G,F,^C,G,,-]": 932,
      "[G,^F,^D,G,,-]": 933,
      "[A-^G]": 934,
      "[B-^F-]": 935,
      "[BF-^D]": 936,
      "[d=A-E-]": 937,
      "[dA^F]": 938,
      "[B,^G,-F,D,A,,]": 939,
      "[g-^f]": 940,
      "[f-^A]": 941,
      "[E,,2E,2]": 942,
      "[_G,-D,-D,,]": 943,
      "[^G,,^F,,-]": 944,
      "[D-G,-B,,-D,,]": 945,
      "[^A-G-EC]": 946,
      "[b^gfd]": 947,
      "[^a=a-]": 948,
      "[V:2Program16mergedown]": 949
    },
    "merges": [
      [
        "V",
        ":"
      ],
      [
        "[",
        "V:"
      ],
      [
        "f",
        "e"
      ],
      [
        "!",
        "fe"
      ],
      [
        "a",
        "!"
      ],
      [
        "a",
        "t"
      ],
      [
        "m",
        "at"
      ],
      [
        "r",
        "mat"
      ],
      [
        "!fe",
        "rmat"
      ],
      [
        "!fermat",
        "a!"
      ],
      [
        "4",
        "]"
      ],
      [
        "[V:",
        "1"
      ],
      [
        "[V:",
        "2"
      ],
      [
        "[V:",
        "3"
      ],
      [
        "[V:1",
        "]"
      ],
      [
        "[V:2",
        "]"
      ],
      [
        "[V:3",
        "]"
      ],
      [
        "[V:",
        "4]"
      ],
      [
        "l",
        "e"
      ],
      [
        "c",
        "le"
      ],
      [
        "f",
        "="
      ],
      [
        "cle",
        "f="
      ],
      [
        "<",
        "|"
      ],
      [
        "|",
        ">"
      ],
      [
        "b",
        "le"
      ],
      [
        "e",
        "ble"
      ],
      [
        "r",
        "eble"
      ],
      [
        "t",
        "reble"
      ],
      [
        "clef=",
        "treble"
      ],
      [
        "o",
        "s"
      ],
      [
        "<|",
        "b"
      ],
      [
        "os",
        "|>"
      ],
      [
        "clef=treble",
        "]"
      ],
      [
        "K",
        ":"
      ],
      [
        "[",
        "K:"
      ],
      [
        "C",
        "]"
      ],
      [
        "8",
        "]"
      ],
      [
        ",",
        "]"
      ],
      [
        "M",
        ":"
      ],
      [
        "[",
        "M:"
      ],
      [
        "a",
        "c"
      ],
      [
        "e",
        "os|>"
      ],
      [
        "h",
        "|>"
      ],
      [
        "<|",
        "eos|>"
      ],
      [
        "<|b",
        "os|>"
      ],
      [
        "<|b",
        "ac"
      ],
      [
        "<|bac",
        "h|>"
      ],
      [
        "1",
        "/"
      ],
      [
        ":",
        "1/"
      ],
      [
        "L",
        ":1/"
      ],
      [
        "[",
        "L:1/"
      ],
      [
        "b",
        "a"
      ],
      [
        "s",
        "]"
      ],
      [
        "s",
        "s]"
      ],
      [
        "ba",
        "ss]"
      ],
      [
        "-",
        "8]"
      ],
      [
        "4",
        "clef="
      ],
      [
        "[V:",
        "4clef="
      ],
      [
        "[V:1",
        "clef=treble]"
      ],
      [
        "[V:2",
        "clef=treble]"
      ],
      [
        "[V:3",
        "clef=treble"
      ],
      [
        "[V:4clef=",
        "bass]"
      ],
      [
        "[V:3clef=treble",
        "-8]"
      ],
      [
        ",",
        "-"
      ],
      [
        "[M:",
        "C]"
      ],
      [
        "[L:1/",
        "4]"
      ],
      [
        "A",
        ","
      ],
      [
        ",-",
        "]"
      ],
      [
        "G",
        "]"
      ],
      [
        "[K:",
        "C]"
      ],
      [
        "B",
        ","
      ],
      [
        "G",
        ","
      ],
      [
        "[L:1/",
        "8]"
      ],
      [
        "[",
        "C"
      ],
      [
        "/",
        "4]"
      ],
      [
        "[",
        "^"
      ],
      [
        "[",
        "D"
      ],
      [
        "F",
        "]"
      ],
      [
        "[K:",
        "G]"
      ],
      [
        "A",
        "]"
      ],
      [
        "b",
        "]"
      ],
      [
        "D",
        ",]"
      ],
      [
        ",",
        "A,"
      ],
      [
        "D",
        "]"
      ],
      [
        "[M:",
        "3"
      ],
      [
        "[",
        "e"
      ],
      [
        "[C",
        ","
      ],
      [
        "[",
        "E"
      ],
      [
        "[M:3",
        "/4]"
      ],
      [
        ",",
        "D,]"
      ],
      [
        "-",
        "]"
      ],
      [
        "d",
        "]"
      ],
      [
        "[",
        "F"
      ],
      [
        "B,",
        ",]"
      ],
      [
        "[",
        "A,"
      ],
      [
        "[",
        "c"
      ],
      [
        "[K:",
        "B"
      ],
      [
        ",A,",
        ",]"
      ],
      [
        "[",
        "G,"
      ],
      [
        "[K:B",
        "b]"
      ],
      [
        "[",
        "A"
      ],
      [
        "[",
        "B"
      ],
      [
        "[",
        "d"
      ],
      [
        "[K:",
        "F]"
      ],
      [
        "[",
        "B,"
      ],
      [
        "[K:",
        "D]"
      ],
      [
        "C",
        ",]"
      ],
      [
        "[M:",
        "4"
      ],
      [
        "[M:4",
        "/4]"
      ],
      [
        "[e",
        "d]"
      ],
      [
        "[",
        "G"
      ],
      [
        "[D",
        ",D,]"
      ],
      [
        "[",
        "g"
      ],
      [
        "G,",
        ",-]"
      ],
      [
        "[C,",
        "C,]"
      ],
      [
        "E",
        "]"
      ],
      [
        "B",
        "]"
      ],
      [
        "G,",
        ",]"
      ],
      [
        "[",
        "="
      ],
      [
        "[K:",
        "A]"
      ],
      [
        "F",
        ",]"
      ],
      [
        "G",
        ",]"
      ],
      [
        ",-",
        "G,,-]"
      ],
      [
        "[^",
        "A,"
      ],
      [
        "[C,",
        "B,,]"
      ],
      [
        "[A",
        "G]"
      ],
      [
        ",",
        "G,,]"
      ],
      [
        "c",
        "]"
      ],
      [
        "[^A,",
        ",A,,]"
      ],
      [
        "[B",
        "A]"
      ],
      [
        "A",
        ",]"
      ],
      [
        "B",
        ",]"
      ],
      [
        "B,",
        ",-]"
      ],
      [
        ",",
        ",]"
      ],
      [
        "[K:",
        "E"
      ],
      [
        "[F",
        ","
      ],
      [
        "[K:E",
        "b]"
      ],
      [
        "E",
        ",]"
      ],
      [
        "f",
        "]"
      ],
      [
        ",-",
        "C"
      ],
      [
        ",",
        ",-]"
      ],
      [
        ",A,",
        ",-]"
      ],
      [
        ",",
        "B,,]"
      ],
      [
        "[",
        "f"
      ],
      [
        "[^",
        "c"
      ],
      [
        "D",
        ",D,]"
      ],
      [
        "A,",
        ",-]"
      ],
      [
        "[c",
        "B]"
      ],
      [
        "A",
        "F]"
      ],
      [
        "[",
        "ba"
      ],
      [
        "[^",
        "d"
      ],
      [
        "[d",
        "c]"
      ],
      [
        "[ba",
        "]"
      ],
      [
        "G",
        ",-]"
      ],
      [
        ",-",
        "D"
      ],
      [
        "[A,",
        ",A,,]"
      ],
      [
        "-",
        "^"
      ],
      [
        "=",
        "d]"
      ],
      [
        "B",
        "G]"
      ],
      [
        "[",
        "fe"
      ],
      [
        "[K:",
        "E]"
      ],
      [
        "[G",
        "F]"
      ],
      [
        "G",
        "-]"
      ],
      [
        "[E",
        ","
      ],
      [
        "[G,",
        "F,]"
      ],
      [
        "[d",
        "AF]"
      ],
      [
        "[g",
        "f]"
      ],
      [
        "1",
        "6"
      ],
      [
        "G",
        "E]"
      ],
      [
        ",-",
        "A,"
      ],
      [
        "[^",
        "D,D,]"
      ],
      [
        "[e",
        "BG]"
      ],
      [
        "[A,",
        "G,]"
      ],
      [
        "[G,",
        ",G,,]"
      ],
      [
        "[=",
        "A,"
      ],
      [
        "[fe",
        "]"
      ],
      [
        "/",
        "8]"
      ],
      [
        "D",
        ",-]"
      ],
      [
        ",-",
        "B,,]"
      ],
      [
        "[C",
        "-"
      ],
      [
        "[E",
        "D]"
      ],
      [
        "[C",
        ",-C"
      ],
      [
        "[^",
        "F"
      ],
      [
        "[D",
        ","
      ],
      [
        "[D",
        ",-G,,-]"
      ],
      [
        "[F",
        ",-"
      ],
      [
        "[g",
        "-"
      ],
      [
        "[^d",
        "=d]"
      ],
      [
        ",-D",
        ",,-]"
      ],
      [
        "A",
        "-]"
      ],
      [
        "B",
        "-]"
      ],
      [
        "C",
        "-]"
      ],
      [
        "E",
        ",-]"
      ],
      [
        "[",
        "_"
      ],
      [
        "d",
        "B]"
      ],
      [
        "[c",
        "-"
      ],
      [
        "[c",
        "GE]"
      ],
      [
        "[c",
        "B-]"
      ],
      [
        "16",
        "]"
      ],
      [
        ",",
        "G,,-]"
      ],
      [
        "=",
        "A]"
      ],
      [
        "D",
        ",-G,,-]"
      ],
      [
        "E",
        ",,]"
      ],
      [
        "F",
        "-]"
      ],
      [
        "[C",
        "B,"
      ],
      [
        "[^",
        "D"
      ],
      [
        "[^",
        "G,"
      ],
      [
        "[D",
        "-"
      ],
      [
        "[D",
        "B,]"
      ],
      [
        "[E",
        ",B,,]"
      ],
      [
        "[G,",
        ",-G,,-]"
      ],
      [
        "[d",
        "-"
      ],
      [
        "[B,",
        ",B,,]"
      ],
      [
        "[g",
        "dB]"
      ],
      [
        "[=",
        "D,D,]"
      ],
      [
        "[C,-C",
        ",-]"
      ],
      [
        "[g-",
        "f]"
      ],
      [
        "[c-",
        "B]"
      ],
      [
        ",",
        "D"
      ],
      [
        "B",
        ",-]"
      ],
      [
        "c",
        "G]"
      ],
      [
        "c",
        "-]"
      ],
      [
        "f",
        "-]"
      ],
      [
        "[L:1/",
        "16]"
      ],
      [
        ",-",
        "B,"
      ],
      [
        "[^",
        "A"
      ],
      [
        "[^",
        "C"
      ],
      [
        "[D",
        "C]"
      ],
      [
        "[e",
        "-"
      ],
      [
        "[c",
        "'"
      ],
      [
        "[B,",
        "A,]"
      ],
      [
        "[g",
        "f-]"
      ],
      [
        "C",
        ",-]"
      ],
      [
        "D",
        "-]"
      ],
      [
        "D",
        ",G,,]"
      ],
      [
        "F",
        ",-]"
      ],
      [
        "F",
        ",-A,"
      ],
      [
        "[",
        "a"
      ],
      [
        "d",
        "-]"
      ],
      [
        "g",
        "]"
      ],
      [
        ",-",
        "G,,]"
      ],
      [
        "[C",
        "F,]"
      ],
      [
        "[^",
        "G"
      ],
      [
        "[e",
        "cG]"
      ],
      [
        "[E",
        ",A,,-]"
      ],
      [
        "[F",
        "-"
      ],
      [
        "[A,",
        "="
      ],
      [
        "[A,",
        ",-D,,-]"
      ],
      [
        "[G,",
        "B,,-]"
      ],
      [
        "[G,",
        "A,,-]"
      ],
      [
        "[A",
        "-"
      ],
      [
        "[B",
        "G]"
      ],
      [
        "[G",
        "B,]"
      ],
      [
        "[g",
        "e"
      ],
      [
        ",-C",
        ",,-]"
      ],
      [
        "[f",
        "-"
      ],
      [
        "[_",
        "D"
      ],
      [
        "[CB,",
        "D,-G,,-]"
      ],
      [
        ",D",
        ",,]"
      ],
      [
        ",",
        "E,,]"
      ],
      [
        "=",
        "D]"
      ],
      [
        "C",
        "A,]"
      ],
      [
        "D",
        "B,]"
      ],
      [
        "E",
        ",A,,]"
      ],
      [
        "F",
        "D]"
      ],
      [
        "G",
        ",-"
      ],
      [
        "^",
        "D]"
      ],
      [
        "c",
        "A]"
      ],
      [
        ",-",
        "A,,-]"
      ],
      [
        "A,",
        ",]"
      ],
      [
        "[C",
        "G,]"
      ],
      [
        "[C",
        "B,]"
      ],
      [
        "[C",
        "B,-]"
      ],
      [
        "[D",
        ",A,,-]"
      ],
      [
        "[D",
        "G,-]"
      ],
      [
        "[M:3",
        "/8]"
      ],
      [
        "[E",
        "-"
      ],
      [
        "[E",
        "G,]"
      ],
      [
        "[F",
        "E]"
      ],
      [
        "[F",
        "CA,]"
      ],
      [
        "[B",
        "-"
      ],
      [
        "[B,",
        "F,]"
      ],
      [
        "[G",
        "-"
      ],
      [
        "[G",
        "DB,]"
      ],
      [
        "[F,",
        "B,,-]"
      ],
      [
        "[F,",
        "E,]"
      ],
      [
        "[f",
        "cA]"
      ],
      [
        "[^c",
        "B]"
      ],
      [
        "[c'",
        "b]"
      ],
      [
        "[A-",
        "G]"
      ],
      [
        ",",
        "C"
      ],
      [
        "=",
        "c]"
      ],
      [
        "=",
        "A,,-]"
      ],
      [
        "A",
        ",-]"
      ],
      [
        "A",
        "b]"
      ],
      [
        "E",
        "-]"
      ],
      [
        "E",
        ",G,,]"
      ],
      [
        "F",
        ",,]"
      ],
      [
        "F",
        ",-B,,]"
      ],
      [
        "[",
        "b"
      ],
      [
        "^",
        "G"
      ],
      [
        "^",
        "D,]"
      ],
      [
        "[K:",
        "Ab]"
      ],
      [
        "[M:",
        "9"
      ],
      [
        ",A,",
        ",D,,]"
      ],
      [
        "[E",
        ",D,]"
      ],
      [
        "[E",
        "F,]"
      ],
      [
        "[F",
        "A,]"
      ],
      [
        "[A,",
        "G,-]"
      ],
      [
        "[c",
        "G]"
      ],
      [
        "[G,",
        "G,,]"
      ],
      [
        "[G,",
        "E,]"
      ],
      [
        "[A",
        "C]"
      ],
      [
        "[B",
        ",-"
      ],
      [
        "[d",
        "B"
      ],
      [
        "[d",
        "c-]"
      ],
      [
        "[B,",
        "D,G,,]"
      ],
      [
        "[B,",
        "E,G,,]"
      ],
      [
        "[G",
        "F-]"
      ],
      [
        "[=",
        "D"
      ],
      [
        "[=",
        "F"
      ],
      [
        "[^A,",
        "="
      ],
      [
        "[F,",
        "E,-]"
      ],
      [
        "[=A,",
        ",A,,]"
      ],
      [
        "[=A,",
        ",-A,,-]"
      ],
      [
        "[C-",
        "F,-A,"
      ],
      [
        "[^F",
        "E]"
      ],
      [
        "[F,-",
        "B,,-]"
      ],
      [
        "[^C",
        ",A,,-]"
      ],
      [
        "[a",
        "g]"
      ],
      [
        "[^G",
        "="
      ],
      [
        "[F-",
        "E]"
      ],
      [
        "[ge",
        "B]"
      ],
      [
        "[_D",
        "-"
      ],
      [
        "[G-",
        "F]"
      ],
      [
        ",",
        "^"
      ],
      [
        "1",
        "2"
      ],
      [
        "2",
        "]"
      ],
      [
        "=",
        "F]"
      ],
      [
        "=",
        "C-]"
      ],
      [
        "F",
        ",,-]"
      ],
      [
        "P",
        "r"
      ],
      [
        "^",
        "G]"
      ],
      [
        "^",
        "A]"
      ],
      [
        "^",
        "G,]"
      ],
      [
        "^",
        "c]"
      ],
      [
        "a",
        "m"
      ],
      [
        "d",
        "A]"
      ],
      [
        "g",
        "r"
      ],
      [
        "o",
        "gr"
      ],
      [
        "[M:",
        "6"
      ],
      [
        "[M:",
        "12"
      ],
      [
        ",-",
        "D,]"
      ],
      [
        "A,",
        "F,]"
      ],
      [
        "[D",
        "F,]"
      ],
      [
        "[D",
        "A,F,]"
      ],
      [
        "[e",
        "^"
      ],
      [
        "[E",
        ",A,,]"
      ],
      [
        "[F",
        ",D,]"
      ],
      [
        "[F",
        "E-]"
      ],
      [
        "[A,",
        "F,]"
      ],
      [
        "[A,",
        ",G,,]"
      ],
      [
        "[A,",
        "B,,-]"
      ],
      [
        "[A,",
        "A,,-]"
      ],
      [
        "[c",
        "-^"
      ],
      [
        "[A",
        "=A]"
      ],
      [
        "[d",
        "G]"
      ],
      [
        "[B,",
        "G,]"
      ],
      [
        "[B,",
        "B,,-]"
      ],
      [
        "[g",
        "d]"
      ],
      [
        "[F,",
        "D,-]"
      ],
      [
        "[f",
        "dA]"
      ],
      [
        "[^c",
        "=c]"
      ],
      [
        "[^d",
        "AF]"
      ],
      [
        "[D-",
        "C]"
      ],
      [
        "[d-",
        "A]"
      ],
      [
        "[e-",
        "d]"
      ],
      [
        "[B-",
        "A]"
      ],
      [
        "[^A,=",
        "A,]"
      ],
      [
        "[^G=",
        "G]"
      ],
      [
        "Pr",
        "ogr"
      ],
      [
        "am",
        "16"
      ],
      [
        "[M:12",
        "/8]"
      ],
      [
        "Progr",
        "am16"
      ],
      [
        ",",
        "="
      ],
      [
        ",",
        "F,,]"
      ],
      [
        "-",
        "a"
      ],
      [
        "-",
        "b]"
      ],
      [
        "-",
        "g]"
      ],
      [
        "/",
        "16]"
      ],
      [
        "/",
        "2]"
      ],
      [
        "=",
        "G,]"
      ],
      [
        "=",
        "E,]"
      ],
      [
        "=",
        "F-]"
      ],
      [
        "=",
        "D-]"
      ],
      [
        "=",
        "A,,]"
      ],
      [
        "A",
        "E]"
      ],
      [
        "C",
        ",,]"
      ],
      [
        "C",
        ",-G,,]"
      ],
      [
        "D",
        "A,]"
      ],
      [
        "D",
        "G,-]"
      ],
      [
        "D",
        ",-G,,]"
      ],
      [
        "E",
        ",-G,,-]"
      ],
      [
        "E",
        "B,]"
      ],
      [
        "E",
        ",B,,]"
      ],
      [
        "F",
        ",A,,D,,]"
      ],
      [
        "F",
        ",^"
      ],
      [
        "G",
        ",-A,"
      ],
      [
        "^",
        "A-]"
      ],
      [
        "^",
        "c-]"
      ],
      [
        "^",
        "D-]"
      ],
      [
        "e",
        "]"
      ],
      [
        "g",
        "e"
      ],
      [
        "fe",
        "]"
      ],
      [
        ",-",
        "C,]"
      ],
      [
        ",-",
        "F,,]"
      ],
      [
        ",-",
        "F,,-]"
      ],
      [
        "B,",
        ",G,,]"
      ],
      [
        "B,",
        ",E,,]"
      ],
      [
        "G,",
        "D,]"
      ],
      [
        "G,",
        "E,]"
      ],
      [
        "G,",
        ",-C,,-]"
      ],
      [
        "G,",
        ",C"
      ],
      [
        "[C",
        "C]"
      ],
      [
        "[C",
        "D,]"
      ],
      [
        "[C",
        "G,,-]"
      ],
      [
        "[C",
        "-^"
      ],
      [
        "[C",
        "E,-]"
      ],
      [
        "[C",
        "E,A,,]"
      ],
      [
        "[C",
        "E,-G,,-]"
      ],
      [
        "[C",
        "F,A,,D,,]"
      ],
      [
        "[C",
        ",-F,,-]"
      ],
      [
        "[^",
        "a"
      ],
      [
        "[D",
        ",A,,]"
      ],
      [
        "[D",
        ",G,,]"
      ],
      [
        "[D",
        ",B,,]"
      ],
      [
        "[D",
        ",-B,,]"
      ],
      [
        "[D",
        "C-]"
      ],
      [
        "[D",
        ",-B,"
      ],
      [
        "[D",
        "F,-]"
      ],
      [
        "[D",
        "=C-]"
      ],
      [
        "[D",
        ",-C,]"
      ],
      [
        "[e",
        "c]"
      ],
      [
        "[e",
        "A-]"
      ],
      [
        "[e",
        "d-]"
      ],
      [
        "[C,",
        "B,,-]"
      ],
      [
        "[C,",
        "C,,]"
      ],
      [
        "[E",
        ",-G,,-]"
      ],
      [
        "[E",
        ",G,,]"
      ],
      [
        "[E",
        "G,-]"
      ],
      [
        "[E",
        "-^"
      ],
      [
        "[E",
        ",-A,"
      ],
      [
        "[E",
        ",-B,"
      ],
      [
        "[E",
        "F,-A,"
      ],
      [
        "[E",
        ",-C,,-]"
      ],
      [
        "[E",
        "^D]"
      ],
      [
        "[E",
        ",-D,]"
      ],
      [
        "[E",
        "DG,-]"
      ],
      [
        "[F",
        ",A,,]"
      ],
      [
        "[F",
        ",A,,-]"
      ],
      [
        "[F",
        ",-A,"
      ],
      [
        "[F",
        ",A,,D,,]"
      ],
      [
        "[F",
        "DA,]"
      ],
      [
        "[A,",
        "B,,]"
      ],
      [
        "[A,",
        "C,]"
      ],
      [
        "[A,",
        "D,-]"
      ],
      [
        "[A,",
        "E,,]"
      ],
      [
        "[A,",
        ",D,,]"
      ],
      [
        "[A,",
        "^G,]"
      ],
      [
        "[A,",
        "B,,E,,]"
      ],
      [
        "[c",
        "AE]"
      ],
      [
        "[c",
        "^A-]"
      ],
      [
        "[K:B",
        "]"
      ],
      [
        "[G,",
        "D,]"
      ],
      [
        "[G,",
        "C,-]"
      ],
      [
        "[G,",
        "F,-]"
      ],
      [
        "[G,",
        ",F,,]"
      ],
      [
        "[A",
        ",-"
      ],
      [
        "[A",
        ",-C"
      ],
      [
        "[A",
        "G-]"
      ],
      [
        "[A",
        ",-B,,]"
      ],
      [
        "[A",
        ",-B,"
      ],
      [
        "[B",
        ",-B,,]"
      ],
      [
        "[B",
        "A-]"
      ],
      [
        "[B",
        ",-G,,]"
      ],
      [
        "[B",
        "FD]"
      ],
      [
        "[d",
        "E]"
      ],
      [
        "[d",
        "=d]"
      ],
      [
        "[d",
        "BG]"
      ],
      [
        "[d",
        "G-]"
      ],
      [
        "[B,",
        "D,]"
      ],
      [
        "[B,",
        ",A,,]"
      ],
      [
        "[B,",
        "C,]"
      ],
      [
        "[B,",
        ",-G,,-]"
      ],
      [
        "[B,",
        ",G,,]"
      ],
      [
        "[B,",
        "E,]"
      ],
      [
        "[B,",
        "D,-]"
      ],
      [
        "[B,",
        "E,-]"
      ],
      [
        "[B,",
        ",G,,-]"
      ],
      [
        "[B,",
        "D,-G,,-]"
      ],
      [
        "[B,",
        "C,-]"
      ],
      [
        "[G",
        ",-G,,-]"
      ],
      [
        "[G",
        ",-C"
      ],
      [
        "[G",
        ",-D"
      ],
      [
        "[G",
        "=F]"
      ],
      [
        "[G",
        "EB,]"
      ],
      [
        "[=",
        "A"
      ],
      [
        "[=",
        "C"
      ],
      [
        "[=",
        "c"
      ],
      [
        "[=",
        "f"
      ],
      [
        "[=",
        "E,B,,]"
      ],
      [
        "[F,",
        "G,,-]"
      ],
      [
        "[F,",
        "G,,-C,,-]"
      ],
      [
        ",-C",
        ",,]"
      ],
      [
        ",-C",
        ",G,,-]"
      ],
      [
        "[f",
        "^"
      ],
      [
        "[f",
        "d-]"
      ],
      [
        "[^c",
        "-"
      ],
      [
        "[^c",
        "G]"
      ],
      [
        "[^c",
        "c]"
      ],
      [
        "[^c",
        "GE]"
      ],
      [
        "[^c",
        "^G"
      ],
      [
        "[^c",
        "^A]"
      ],
      [
        ",-D",
        ",,]"
      ],
      [
        "[fe",
        "-]"
      ],
      [
        "[E,",
        "E,]"
      ],
      [
        "[E,",
        "C,-]"
      ],
      [
        "[E,",
        "^D,]"
      ],
      [
        "[E,",
        "=A,,]"
      ],
      [
        "[E,",
        "G,,C"
      ],
      [
        "[=A,",
        ",-C,,-]"
      ],
      [
        "[C-",
        "E,]"
      ],
      [
        "[C-",
        "D,-G,,]"
      ],
      [
        "[C-",
        "G,-A,"
      ],
      [
        "[C,-C",
        ",,-]"
      ],
      [
        "[^F",
        ",A,,-]"
      ],
      [
        "[D,",
        "C,]"
      ],
      [
        "[D,",
        "B,,-]"
      ],
      [
        "[D,",
        "C,-G,,]"
      ],
      [
        "[D,",
        "B,,G,,]"
      ],
      [
        "[F,-",
        "E,]"
      ],
      [
        "[F,-",
        "A,,-]"
      ],
      [
        "[F,-",
        "=A,,-]"
      ],
      [
        "[_",
        "G,-"
      ],
      [
        "[CB,",
        "D,G,,]"
      ],
      [
        "[^D",
        "=D]"
      ],
      [
        "[^D",
        ",="
      ],
      [
        "[^D",
        "=D-]"
      ],
      [
        "[D-",
        "F,-B,,]"
      ],
      [
        "[d-",
        "=d]"
      ],
      [
        "[^A",
        "G-]"
      ],
      [
        "[^A",
        "=A]"
      ],
      [
        "[c'",
        "-b]"
      ],
      [
        "[a",
        "-g]"
      ],
      [
        "[A,=",
        "B,,]"
      ],
      [
        "[f-",
        "d]"
      ],
      [
        "[f-",
        "e]"
      ],
      [
        "[_D",
        "=E,]"
      ],
      [
        "G,-",
        "C,]"
      ],
      [
        "[E-",
        "F,-B,,]"
      ],
      [
        "[E-",
        "G,-C,]"
      ],
      [
        "[B-",
        "G-]"
      ],
      [
        ",C",
        ",,-]"
      ],
      [
        "[b",
        "-a"
      ],
      [
        "^G",
        "FD]"
      ],
      [
        "[M:9",
        "/8]"
      ],
      [
        "[M:9",
        "/16]"
      ],
      [
        "[B,-",
        "A,]"
      ],
      [
        "[dB",
        "F]"
      ],
      [
        "[=D",
        ",G,,-]"
      ],
      [
        "[=D",
        ",-C,G,,-]"
      ],
      [
        "[=F",
        ",D,]"
      ],
      [
        "[C-F,-A,",
        ",]"
      ],
      [
        "[C-F,-A,",
        ",-D,,-]"
      ],
      [
        "[_D-",
        "E,]"
      ],
      [
        "[_D-",
        "E,A,,]"
      ],
      [
        "[M:6",
        "/4]"
      ],
      [
        "[c-^",
        "G-]"
      ],
      [
        "[C-^",
        "A,]"
      ],
      [
        "[D,-B,",
        ",-G,,-]"
      ],
      [
        "[E,-A,",
        ",C,,-]"
      ],
      [
        "[E,-B,",
        ",-C,,]"
      ],
      [
        "[EF,-A,",
        ",]"
      ],
      [
        "[F,-A,",
        ",-D,,-]"
      ],
      [
        "[A,-C",
        ",-F,,]"
      ],
      [
        "[A,-B,",
        ",E,,]"
      ],
      [
        "[G,-C",
        ",-]"
      ],
      [
        "[G,-D",
        ",-]"
      ],
      [
        "[E,G,,C",
        ",,]"
      ],
      [
        "[C-G,-A,",
        ",]"
      ],
      [
        "[_G,-",
        "=A,,-]"
      ],
      [
        "[b-a",
        "]"
      ],
      [
        ",",
        "2"
      ],
      [
        ",",
        "B,,-]"
      ],
      [
        ",",
        "E,]"
      ],
      [
        ",",
        "2]"
      ],
      [
        "-",
        "E"
      ],
      [
        "-",
        "G"
      ],
      [
        "-",
        "d]"
      ],
      [
        "-",
        "E]"
      ],
      [
        "-",
        "G-]"
      ],
      [
        "-",
        "B,-]"
      ],
      [
        "-",
        "E-]"
      ],
      [
        "1",
        "[V:2]"
      ],
      [
        "2",
        "[V:2]"
      ],
      [
        "=",
        "A"
      ],
      [
        "=",
        "a"
      ],
      [
        "=",
        "C]"
      ],
      [
        "=",
        "D,]"
      ],
      [
        "=",
        "F,]"
      ],
      [
        "=",
        "G,-]"
      ],
      [
        "=",
        "A-]"
      ],
      [
        "=",
        "c-]"
      ],
      [
        "=",
        "F,-]"
      ],
      [
        "=",
        "E,A,,]"
      ],
      [
        "A",
        "^"
      ],
      [
        "B",
        ",-G,,-]"
      ],
      [
        "B",
        "G-]"
      ],
      [
        "B",
        "-G-]"
      ],
      [
        "C",
        ",G,,-]"
      ],
      [
        "D",
        "b]"
      ],
      [
        "D",
        ",G,,-]"
      ],
      [
        "E",
        ",A,,-]"
      ],
      [
        "E",
        ",2]"
      ],
      [
        "E",
        "-E]"
      ],
      [
        "F",
        ",D,]"
      ],
      [
        "F",
        "-^"
      ],
      [
        "F",
        ",D"
      ],
      [
        "G",
        "F]"
      ],
      [
        "G",
        "D]"
      ],
      [
        "G",
        ",-D"
      ],
      [
        "G",
        ",-B,"
      ],
      [
        "G",
        "^D]"
      ],
      [
        "[",
        "1[V:2]"
      ],
      [
        "[",
        "2[V:2]"
      ],
      [
        "^",
        "g"
      ],
      [
        "^",
        "C,]"
      ],
      [
        "^",
        "A,]"
      ],
      [
        "^",
        "D,-]"
      ],
      [
        "^",
        "C-]"
      ],
      [
        "^",
        "F-]"
      ],
      [
        "^",
