{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|bach|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|mozart|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "<\\|[^|]+\\|>|\\[[^\\]]+\\]|![^!]+!|[a-zA-Z]|\\d|\\||\\^|_|=|,|'|\\/|\\(|\\)|-"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|unk|>": 1,
      "<|bos|>": 2,
      "<|eos|>": 3,
      "<|bach|>": 4,
      "<|mozart|>": 5,
      "!": 6,
      "#": 7,
      "'": 8,
      "(": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      "<": 25,
      "=": 26,
      ">": 27,
      "A": 28,
      "B": 29,
      "C": 30,
      "D": 31,
      "E": 32,
      "F": 33,
      "G": 34,
      "K": 35,
      "L": 36,
      "M": 37,
      "P": 38,
      "S": 39,
      "V": 40,
      "[": 41,
      "]": 42,
      "^": 43,
      "_": 44,
      "a": 45,
      "b": 46,
      "c": 47,
      "d": 48,
      "e": 49,
      "f": 50,
      "g": 51,
      "h": 52,
      "i": 53,
      "j": 54,
      "l": 55,
      "m": 56,
      "n": 57,
      "o": 58,
      "p": 59,
      "r": 60,
      "s": 61,
      "t": 62,
      "u": 63,
      "w": 64,
      "x": 65,
      "z": 66,
      "|": 67,
      "V:": 68,
      "[V:": 69,
      "ma": 70,
      "fe": 71,
      "!fe": 72,
      "a!": 73,
      "rma": 74,
      "ta!": 75,
      "!ferma": 76,
      "!fermata!": 77,
      "4]": 78,
      "[V:1": 79,
      "[V:2": 80,
      "[V:3": 81,
      "[V:1]": 82,
      "[V:2]": 83,
      "[V:3]": 84,
      "[V:4]": 85,
      "le": 86,
      "f=": 87,
      "cle": 88,
      "clef=": 89,
      "<|": 90,
      "|>": 91,
      "ble": 92,
      "eble": 93,
      "reble": 94,
      "treble": 95,
      "clef=treble": 96,
      "os": 97,
      "<|b": 98,
      "os|>": 99,
      "clef=treble]": 100,
      "K:": 101,
      "[K:": 102,
      "8]": 103,
      "M:": 104,
      "[M:": 105,
      ",]": 106,
      "j]": 107,
      "maj]": 108,
      "ac": 109,
      "eos|>": 110,
      "h|>": 111,
      "<|bac": 112,
      "1/": 113,
      ":1/": 114,
      "L:1/": 115,
      "[L:1/": 116,
      "C]": 117,
      "ba": 118,
      "ss": 119,
      "bass": 120,
      "clef=bass": 121,
      "-8]": 122,
      "4clef=bass": 123,
      "[V:4clef=bass": 124,
      "[V:1clef=treble]": 125,
      "[V:2clef=treble]": 126,
      "[V:3clef=treble": 127,
      "[V:4clef=bass]": 128,
      "[V:3clef=treble-8]": 129,
      "[M:C]": 130,
      ",-": 131,
      "[L:1/4]": 132,
      ",-]": 133,
      "[L:1/8]": 134,
      "bmaj]": 135,
      "B,": 136,
      "/4]": 137,
      "[^": 138,
      "A,": 139,
      "[F": 140,
      "[G": 141,
      "-]": 142,
      "[E": 143,
      "[C": 144,
      "[D": 145,
      "[K:B": 146,
      "[K:A": 147,
      "[c": 148,
      "[K:F": 149,
      "[K:D": 150,
      "[K:E": 151,
      "[M:3": 152,
      "[d": 153,
      "[M:3/4]": 154,
      "[e": 155,
      "F,]": 156,
      "[B,": 157,
      "[B": 158,
      "[g": 159,
      "G,]": 160,
      "[A": 161,
      "G]": 162,
      "f]": 163,
      "[a": 164,
      "[M:4": 165,
      "A,]": 166,
      "d]": 167,
      "D,]": 168,
      "E,]": 169,
      "']": 170,
      "[M:4/4]": 171,
      "[A,": 172,
      "[=": 173,
      "B,]": 174,
      "B]": 175,
      "[G,": 176,
      "c]": 177,
      "[F,": 178,
      "A]": 179,
      "C,]": 180,
      "[K:Abmaj]": 181,
      "b]": 182,
      "[K:Emaj]": 183,
      "[f": 184,
      "[K:F#": 185,
      "[K:F#maj]": 186,
      "g]": 187,
      "[K:Bmaj]": 188,
      "[K:Dbmaj]": 189,
      "[K:Ebmaj]": 190,
      "G,": 191,
      "[K:Amaj]": 192,
      "[c'": 193,
      "[K:Bbmaj]": 194,
      "[K:Fmaj]": 195,
      "[K:Dmaj]": 196,
      "[E,": 197,
      "[K:G": 198,
      "[K:Gmaj]": 199,
      "F]": 200,
      "D]": 201,
      "B,,]": 202,
      "E]": 203,
      "[d'": 204,
      "[fe": 205,
      "e]": 206,
      "[K:C": 207,
      "[K:Cmaj]": 208,
      "[fe]": 209,
      "[gf]": 210,
      "[D,": 211,
      "F,": 212,
      "[K:C]": 213,
      "[b": 214,
      "F,-]": 215,
      "C,-]": 216,
      "B,,-]": 217,
      "[ed]": 218,
      "c']": 219,
      "[^^": 220,
      "A,,]": 221,
      "[ba": 222,
      "[C,": 223,
      "E,-]": 224,
      "[ag]": 225,
      "[F,F,]": 226,
      "[cB]": 227,
      "[ba]": 228,
      "[dc]": 229,
      "E,": 230,
      "[BA]": 231,
      "D,-]": 232,
      "[e'": 233,
      "D,": 234,
      "-^": 235,
      "[c'b]": 236,
      "[d'c']": 237,
      "G,-]": 238,
      "A,,-]": 239,
      "[G,G,]": 240,
      "[K:G]": 241,
      "[D,D,]": 242,
      "[B,-": 243,
      "[E,E,]": 244,
      "[B,A,]": 245,
      "[B,B,]": 246,
      "[C-": 247,
      "[A,-": 248,
      "A,-]": 249,
      "[F,-": 250,
      "[A,A,]": 251,
      "[AG]": 252,
      "a]": 253,
      "[f'": 254,
      "[C,C,]": 255,
      "[D-": 256,
      "[_": 257,
      "C,": 258,
      "[G,-": 259,
      "16": 260,
      "G,,]": 261,
      "[E,-": 262,
      "/8]": 263,
      "[A,G,]": 264,
      "B,-]": 265,
      "[FE]": 266,
      "[F,E,]": 267,
      "[ED]": 268,
      ",A,,]": 269,
      "[E-": 270,
      "d']": 271,
      "[G,F,]": 272,
      "G,,-]": 273,
      "C-]": 274,
      "[GF]": 275,
      "[DC]": 276,
      "-=": 277,
      "16]": 278,
      "[K:Bb]": 279,
      "F,F,]": 280,
      "[E,D,]": 281,
      "D,D,]": 282,
      "c'": 283,
      "e']": 284,
      "[CB,]": 285,
      "[K:D]": 286,
      "[^A,": 287,
      "[g-": 288,
      "[G-": 289,
      "[K:F]": 290,
      "F-]": 291,
      "[e-": 292,
      "[B-": 293,
      "G,-": 294,
      "D-]": 295,
      "F,-": 296,
      "[f-": 297,
      "fd]": 298,
      "[D,C,]": 299,
      "B-]": 300,
      "f-]": 301,
      "[a-": 302,
      "G,G,]": 303,
      "[F-": 304,
      "[d-": 305,
      "A-]": 306,
      "G-]": 307,
      "[c-": 308,
      "[b-": 309,
      "[C,B,,]": 310,
      "c-]": 311,
      "cA]": 312,
      "BG]": 313,
      "^^": 314,
      "ec]": 315,
      "[CC]": 316,
      "[e'd']": 317,
      "dB]": 318,
      "d-]": 319,
      "[L:1/16]": 320,
      "A,-": 321,
      "[A-": 322,
      "E-]": 323,
      "ge]": 324,
      "[bfd]": 325,
      "[f'e']": 326,
      ",-G,,-]": 327,
      "C-": 328,
      "[^d": 329,
      "C,C,]": 330,
      "[c'-": 331,
      "[g'": 332,
      "g-]": 333,
      "[C,-": 334,
      "[K:A]": 335,
      "[B,,": 336,
      "[=B,": 337,
      "E,-": 338,
      "B,-": 339,
      "[aec]": 340,
      "[fcA]": 341,
      "[^A,,A,,]": 342,
      "AF]": 343,
      "f']": 344,
      "[^c": 345,
      "[eBG]": 346,
      "[c'ge]": 347,
      "[gdB]": 348,
      "[^D,D,]": 349,
      "[M:3/8]": 350,
      "[g-f]": 351,
      "[=e": 352,
      "[=A,": 353,
      "[e-d]": 354,
      "[^F,F,]": 355,
      "F,,]": 356,
      "[f-e]": 357,
      "[^G,G,]": 358,
      "[a'": 359,
      "[c-B]": 360,
      "[^C": 361,
      "F,,-]": 362,
      "[g'f']": 363,
      "D-": 364,
      "g']": 365,
      "[^e": 366,
      "[a-g]": 367,
      "[d'-": 368,
      "[b-a]": 369,
      "[F,-B,,-]": 370,
      "[d-c]": 371,
      "E-": 372,
      "b-]": 373,
      "[^g": 374,
      "[ag-]": 375,
      "E,,]": 376,
      "[B,,B,,]": 377,
      "d'": 378,
      "[gf-]": 379,
      "E,E,]": 380,
      "af]": 381,
      "[M:9": 382,
      "[ed-]": 383,
      "[AC]": 384,
      "F,B,,]": 385,
      "E,A,,]": 386,
      "e-]": 387,
      "[^^F,F,]": 388,
      "[K:Eb]": 389,
      "[B,F,]": 390,
      "[G,-C,-]": 391,
      "[a'g']": 392,
      "12": 393,
      "[M:12": 394,
      "[^a": 395,
      "[CG,]": 396,
      "[M:12/8]": 397,
      ",G,,]": 398,
      "[dAF]": 399,
      "[d'af]": 400,
      "^f]": 401,
      "[EC]": 402,
      "[dc-]": 403,
      "[=b": 404,
      "[e'-": 405,
      "D,-": 406,
      "GE]": 407,
      "[BD]": 408,
      "[fe-]": 409,
      "[B-A]": 410,
      "[c'-b]": 411,
      "=d]": 412,
      "C,-": 413,
      "[GB,]": 414,
      "[DA,]": 415,
      "[cE]": 416,
      "[dF]": 417,
      "[B,E,-]": 418,
      "[A,,A,,]": 419,
      "[G,C,-]": 420,
      "[^^f": 421,
      "[ba-]": 422,
      "[E,-A,,-]": 423,
      "2]": 424,
      "[^G": 425,
      "[^C,C,]": 426,
      "[EA,-]": 427,
      "[CF,-]": 428,
      "[DG,-]": 429,
      "Pr": 430,
      "am": 431,
      "gr": 432,
      "ogr": 433,
      "[^F": 434,
      "[FD]": 435,
      "Progr": 436,
      "Program": 437,
      "[^B,": 438,
      "[GF-]": 439,
      "[D,-": 440,
      "[DB,]": 441,
      "[cB-]": 442,
      "A,D,]": 443,
      "E,,-]": 444,
      "[A,-D,-]": 445,
      "FD]": 446,
      "[M:6": 447,
      "[^A": 448,
      "[^E,E,]": 449,
      "[A,E,]": 450,
      "[=a": 451,
      "[^^C,C,]": 452,
      "-^^": 453,
      "[^D": 454,
      "[^b": 455,
      "[EG,]": 456,
      "[CB,-]": 457,
      "[DF,-]": 458,
      "[^^D,D,]": 459,
      "[B,-E,-]": 460,
      "[C-F,-]": 461,
      "[E,-E,-]": 462,
      "F,-B,,-]": 463,
      "[C,-C,-]": 464,
      "E,-A,,-]": 465,
      "[d'-c']": 466,
      "=A,]": 467,
      "[CF,]": 468,
      "[eG]": 469,
      "[B,,-": 470,
      "[BG]": 471,
      "[BA-]": 472,
      "[af]": 473,
      "[c'a": 474,
      "[A-G]": 475,
      "B,,": 476,
      "[DC-]": 477,
      "[B,G,]": 478,
      "[=d": 479,
      "[F,B,,-]": 480,
      "[E,B,,]": 481,
      "[f'-": 482,
      "=A]": 483,
      "_e]": 484,
      "[FE-]": 485,
      "[cGE]": 486,
      "[F,C,]": 487,
      "G,C,]": 488,
      "[c'b-]": 489,
      "=D]": 490,
      "bg]": 491,
      "[FA,]": 492,
      "[ED-]": 493,
      "[cA]": 494,
      "[=E": 495,
      "[bg": 496,
      "[^^G,G,]": 497,
      "D,,-]": 498,
      "[F,-F,-]": 499,
      "c'-]": 500,
      "[^d=d]": 501,
      "[e'-d']": 502,
      "=B,]": 503,
      "=e]": 504,
      "eB]": 505,
      "fc]": 506,
      "[^B": 507,
      "[^G,": 508,
      "[FC]": 509,
      "[EF,]": 510,
      "[CA,]": 511,
      "[ge]": 512,
      "[AG-]": 513,
      "[B,-A,]": 514,
      "[D-C]": 515,
      "[^E": 516,
      "[EG,-]": 517,
      "[CE,-]": 518,
      "[D,-G,,-]": 519,
      "[BFD]": 520,
      "[=B": 521,
      "[e'bg]": 522,
      "[C-B,]": 523,
      "Program16": 524,
      "/2]": 525,
      "EC]": 526,
      "^c]": 527,
      "^g]": 528,
      "[B,C,-]": 529,
      "[B,A,-]": 530,
      "[geB]": 531,
      "[G-F]": 532,
      "=B]": 533,
      "bf]": 534,
      "f=f]": 535,
      "[^c'": 536,
      "[FG,]": 537,
      "[ED": 538,
      "[K:E]": 539,
      "[ec": 540,
      "[G,F,-]": 541,
      "[G,,G,,]": 542,
      "B,,E,,]": 543,
      "[f'-e']": 544,
      "/16]": 545,
      "CA,]": 546,
      "_B]": 547,
      "[GE]": 548,
      "[DG,]": 549,
      "[afc]": 550,
      "[A,F,]": 551,
      "[fd": 552,
      "[M:9/8]": 553,
      "[M:9/16]": 554,
      "[c'ae]": 555,
      "[bgd]": 556,
      "=E]": 557,
      "DB,]": 558,
      "F-": 559,
      "^G,]": 560,
      "_B,]": 561,
      "_b]": 562,
      "B,,-": 563,
      "[FA,-]": 564,
      "[EF,-]": 565,
      "[DF,]": 566,
      "[BA": 567,
      "[A,C,-]": 568,
      "[G,B,,-]": 569,
      "[fA]": 570,
      "[d'bf]": 571,
      "C,,-]": 572,
      "C,F,,]": 573,
      "G,-C,]": 574,
      "[C,-F,,-]": 575,
      "[M:6/4]": 576,
      "=c]": 577,
      "=g]": 578,
      "CF,]": 579,
      "B,E,]": 580,
      "[EB,]": 581,
      "[ec]": 582,
      "[A,B,,-]": 583,
      "[A,D,-]": 584,
      "[=A": 585,
      "[G,D,]": 586,
      "[^^F": 587,
      "[F,-E,]": 588,
      "[=B,B,]": 589,
      "[ecG]": 590,
      "^G]": 591,
      "^F]": 592,
      "^D]": 593,
      "[^f": 594,
      "[C^": 595,
      "[DF,B,,]": 596,
      "[dB]": 597,
      "[B,D,]": 598,
      "[g-^": 599,
      "[AEC]": 600,
      "[A,F,-]": 601,
      "[A,G,-]": 602,
      "[=D,D,]": 603,
      "D,,]": 604,
      "D,G,,]": 605,
      "[G,-F,]": 606,
      "A,-D,-]": 607,
      "d'-]": 608,
      "=E,]": 609,
      "=a]": 610,
      "fe]": 611,
      "[^f=f]": 612,
      "[FB,]": 613,
      "[FB,-]": 614,
      "[GD]": 615,
      "[GC-]": 616,
      "[DC": 617,
      "[DE,-]": 618,
      "[B,,A,,]": 619,
      "[fd]": 620,
      "[bf]": 621,
      "[^^C": 622,
      "c'a]": 623,
      "[F-E]": 624,
      "[^CC]": 625,
      "[fdA]": 626,
      ",B,,]": 627,
      "=C]": 628,
      "=G]": 629,
      "D,-G,,-]": 630,
      "c-": 631,
      "e'": 632,
      ",-D,,-]": 633,
      "[GF": 634,
      "[GA,]": 635,
      "[CE,A,,]": 636,
      "[AE]": 637,
      "[bg]": 638,
      "[A,-G,]": 639,
      "G,-C,-]": 640,
      "F,-B,,]": 641,
      "[^^f^f]": 642,
      "=G,]": 643,
      "=F]": 644,
      "[GC]": 645,
      "[B,D,-]": 646,
      "[AF]": 647,
      "[AC-]": 648,
      "[=D": 649,
      "[G,E,]": 650,
      "[f^": 651,
      "[E,A,,]": 652,
      "[^^g": 653,
      "[E-D]": 654,
      "[=B,,B,,]": 655,
      "=b]": 656,
      "G-": 657,
      "A,F,]": 658,
      "[FG,-]": 659,
      "[GDB,]": 660,
      "[DE,]": 661,
      "[B,^": 662,
      "[B,E,]": 663,
      "[BC]": 664,
      "[BE]": 665,
      "[AB,]": 666,
      "[ae]": 667,
      "[=C": 668,
      "[=E,": 669,
      "[G,E,-]": 670,
      "[G,,-G,,-]": 671,
      "[F,B,,]": 672,
      "[E,C,-]": 673,
      "[d'c'-]": 674,
      "[e'c'": 675,
      "[e'd'-]": 676,
      "[A,-A,-]": 677,
      "[f'c'a]": 678,
      "F,-A,,]": 679,
      "C-F,]": 680,
      "C-F,-]": 681,
      "B,-E,]": 682,
      "[^cB]": 683,
      "[B,,-B,,-]": 684,
      "[f=": 685,
      "^A]": 686,
      "[^F,": 687,
      "[FCA,]": 688,
      "[CD,-]": 689,
      "[dB": 690,
      "[F,E,-]": 691,
      "[F,D,-]": 692,
      "[_B,": 693,
      "[d-A]": 694,
      "C-E,]": 695,
      "[=e_e]": 696,
      "[^e=e]": 697,
      "DF,]": 698,
      "a']": 699,
      "ge": 700,
      "ba]": 701,
      "A,,": 702,
      "[FE": 703,
      "[CD,]": 704,
      "[c^": 705,
      "[B,C,]": 706,
      "[BD-]": 707,
      "[AD]": 708,
      "[AD-]": 709,
      "[A,C,]": 710,
      "[A,A,,]": 711,
      "[G,G,,]": 712,
      "[f-=": 713,
      "G,E,]": 714,
      "[b'": 715,
      "[^^c": 716,
      "[^^c'": 717,
      "[D-G,-": 718,
      "[E-G,-C,]": 719,
      "[g-d]": 720,
      "[e-B]": 721,
      "[f-c]": 722,
      "[a-e]": 723,
      "A,-D,]": 724,
      "B,-D,]": 725,
      "[^g=g]": 726,
      "[=b_b]": 727,
      "C,-F,,-]": 728,
      "[e'c'g]": 729,
      "^C]": 730,
      "^D,]": 731,
      "_E]": 732,
      "B,D,]": 733,
      "[GB,-]": 734,
      "[CE,]": 735,
      "[CA,-]": 736,
      "[DB,-]": 737,
      "[c-^": 738,
      "[dE]": 739,
      "[B,B,,]": 740,
      "[B,G,-]": 741,
      "[BF]": 742,
      "[gB]": 743,
      "[M:4/2]": 744,
      "[G,C,]": 745,
      "[E,-D,]": 746,
      "[^A,A,]": 747,
      "A,-C,]": 748,
      "[g'-": 749,
      "[^c=c]": 750,
      "[^B,B,]": 751,
      "e'-]": 752,
      "[dBF]": 753,
      "1[V:2]": 754,
      "2[V:2]": 755,
      "=c']": 756,
      "=B-]": 757,
      "DG,]": 758,
      "[1[V:2]": 759,
      "[2[V:2]": 760,
      "do": 761,
      "er": 762,
      "m]": 763,
      "mer": 764,
      "n]": 765,
      "p]": 766,
      "up]": 767,
      "wn]": 768,
      "[V:1Program16": 769,
      "[V:2Program16": 770,
      ",-A,,-]": 771,
      "[GC": 772,
      "[GB,E,]": 773,
      "[EA,": 774,
      "[EG,C,]": 775,
      "[CC,]": 776,
      "[CC,-]": 777,
      "[DG,": 778,
      "[cF-]": 779,
      "[M:3/2]": 780,
      "[dG]": 781,
      "[d-=": 782,
      "[e^": 783,
      "[B,F,-]": 784,
      "[B,B,,-]": 785,
      "[AG": 786,
      "[ACF,]": 787,
      "[A,D,]": 788,
      "[A,,G,,]": 789,
      "[=F,F,]": 790,
      "[=G,G,]": 791,
      "[f-^": 792,
      "[c'a]": 793,
      "[B,-B,-]": 794,
      "[C-E,]": 795,
      "[F,-A,,-]": 796,
      "[f'e'-]": 797,
      "[^a=a]": 798,
      "[D,-D,-]": 799,
      "[B,,-E,,-]": 800,
      "[EDF,-B,,-]": 801,
      "B,,-E,,-]": 802,
      "[BAC-F,-]": 803,
      "[DCE,-A,,-]": 804,
      "[GFA,-D,-]": 805,
      "gedo": 806,
      "mergedo": 807,
      "[V:1Program16up]": 808,
      "[V:2Program16mergedo": 809,
      "[V:2Program16mergedown]": 810,
      "=F-]": 811,
      "=D-]": 812,
      "=G-]": 813,
      "B-": 814,
      "^F,]": 815,
      "^E,]": 816,
      "[GA,-]": 817,
      "[EA,]": 818,
      "[CB,": 819,
      "[C-^": 820,
      "[cG]": 821,
      "[a-^": 822,
      "[=G,-": 823,
      "[F,D,]": 824,
      "[D-F,]": 825,
      "C,,]": 826,
      "[B-D]": 827,
      "[F-C]": 828,
      "[b-f]": 829,
      "[^dc]": 830,
      "[c'-g]": 831,
      "[=ed]": 832,
      "E-G,]": 833,
      "[^G=G]": 834,
      "[M:6/8]": 835,
      "[g'-f']": 836,
      "=F,]": 837,
      "=A-]": 838,
      "FC]": 839,
      "^c']": 840,
      "^F-]": 841,
      "_A,]": 842,
      "a-]": 843,
      "[V:3clef=bass": 844,
      "B,G,]": 845,
      "[^E,": 846,
      "[^fe]": 847,
      "[F^": 848,
      "[FF,]": 849,
      "[F-=": 850,
      "[FA,D,]": 851,
      "[EC-]": 852,
      "[CF,": 853,
      "[c-=": 854,
      "[d^": 855,
      "[d-^": 856,
      "[B,D,G,,]": 857,
      "[ADF,]": 858,
      "[A,=": 859,
      "[=G": 860,
      "[=g": 861,
      "[=E,E,]": 862,
      "[=D,-": 863,
      "[G,A,,-]": 864,
      "[F,C,-]": 865,
      "[F,A,,]": 866,
      "[fB]": 867,
      "[E,B,,-]": 868,
      "[d'b]": 869,
      "[D,C,-]": 870,
      "[D,B,,-]": 871,
      "[b^": 872,
      "[B,-D,-]": 873,
      "[C-E,-]": 874,
      "[A,-F,]": 875,
      "[A,-C,-]": 876,
      "[f'd'": 877,
      "[D-F,-B,,]": 878,
      "[_D": 879,
      "[G,-B,,-]": 880,
      "[E,-G,,-]": 881,
      "[E-A,-]": 882,
      "[g-B]": 883,
      "[G-B,]": 884,
      "[G-B,-E,]": 885,
      "[f-A]": 886,
      "^^F,]": 887,
      "^^c]": 888,
      "D-E,]": 889,
      "E-A,]": 890,
      "[^gf]": 891,
      "D,-G,,]": 892,
      "Program16]": 893,
      "[=ag]": 894,
      "[=dc]": 895,
      "[^c'=c']": 896,
      "[^^g^g]": 897,
      "[b'a']": 898,
      "[V:3clef=bassProgram16]": 899,
      "=A,,-]": 900,
      "=C-]": 901,
      "=E-]": 902,
      "A-": 903,
      "^A,]": 904,
      "_B-]": 905,
      "[F-^": 906,
      "[FB,D,]": 907,
      "[DD]": 908,
      "[dA]": 909,
      "[B-^": 910,
      "[gd]": 911,
      "[g-=": 912,
      "[=D,": 913,
      "[fG]": 914,
      "[fdB]": 915,
      "[c'^": 916,
      "[E,A,,-]": 917,
      "[C-A,]": 918,
      "[E,-C,]": 919,
      "[F-A,]": 920,
      "[=A,A,]": 921,
      "[=A,,A,,]": 922,
      "[a'-": 923,
      "[^A=A]": 924,
      "[^D=D]": 925,
      "[f-=f]": 926,
      "=c-]": 927,
      "=d-]": 928,
      "^C-]": 929,
      "_d]": 930,
      "_E-]": 931,
      ",-C,,-]": 932,
      "B,F,-]": 933,
      "[^D,": 934,
      "[^F,-": 935,
      "A,,-D,,-]": 936,
      "[FC-]": 937,
      "[GG,-]": 938,
      "[CG,-]": 939,
      "[D-^": 940,
      "[K:Ab]": 941,
      "[cE-]": 942,
      "[dF-]": 943,
      "[eB]": 944,
      "[eA-]": 945,
      "[B,E,": 946,
      "[B-=": 947,
      "[gc]": 948,
      "[gec]": 949,
      "[A_": 950,
      "[A-^": 951,
      "[A,B,,]": 952,
      "[A,^G,]": 953,
      "[=E-": 954,
      "[=d'": 955,
      "[=ba]": 956,
      "[G,B,,E,,]": 957,
      "[fB-]": 958,
      "G,B,,-]": 959,
      "[c'-^": 960,
      "[c'-=": 961,
      "[c'f-]": 962,
      "[E,D,-]": 963,
      "[b-^": 964,
      "[be-]": 965,
      "[^^G": 966,
      "[e'b]": 967,
      "[B,-G,]": 968,
      "[C-G,-": 969,
      "[C-F,-A,,]": 970,
      "[A,-B,,]": 971,
      "[D-G,-]": 972,
      "[D-A,-": 973,
      "[G,-G,-]": 974,
      "[E-G,]": 975,
      "[E-F,-B,,]": 976,
      "[G-C-E,]": 977,
      "[e-G]": 978,
      "[B-F]": 979,
      "[B-D-": 980,
      "[B-C-F,]": 981,
      "[a-c]": 982,
      "[F-G,-C,]": 983,
      "[F-A,-D,]": 984,
      "[c-G]": 985,
      "^^f]": 986,
      "[A-D-": 987,
      "[A-C-F,]": 988,
      "[c'-e]": 989,
      "B,-E,-]": 990,
      "[=e'": 991,
      "[=A,,-A,,-]": 992,
      "[^ag]": 993,
      "[D,-C,]": 994,
      "[^b=b]": 995,
      "[g-^f]": 996,
      "[=CC]": 997,
      "[_B,B,]": 998,
      "A,,D,,]": 999,
      "[D-G,-B,,]": 1000,
      "[GCE,]": 1001,
      "[EA,C,]": 1002,
      "[DG,B,,]": 1003,
      "[CF,A,,]": 1004,
      "[f'd'a]": 1005,
      "[a'-g']": 1006,
      "[B,E,G,,]": 1007,
      "[C-G,-A,,]": 1008,
      "[D-A,-B,,]": 1009,
      ",2": 1010,
      "AE]": 1011,
      "GD]": 1012,
      "^C,-]": 1013,
      "^D,-]": 1014,
      "^f-]": 1015,
      "_A]": 1016,
      "_a]": 1017,
      "d-": 1018,
      "ac]": 1019,
      "[^G,-": 1020,
      "[FF,-]": 1021,
      "[EE,]": 1022,
      "[E^D]": 1023,
      "[DD,]": 1024,
      "[DD,-]": 1025,
      "[cF]": 1026,
      "[cAE]": 1027,
      "[eA]": 1028,
      "[e-^": 1029,
      "[BE-]": 1030,
      "[BGD]": 1031,
      "[AB,-]": 1032,
      "[A-=": 1033,
      "[A=A]": 1034,
      "[aB]": 1035,
      "[a-=": 1036,
      "[A,E,-]": 1037,
      "[=F,": 1038,
      "[fc]": 1039,
      "[c'f]": 1040,
      "F,C,-]": 1041,
      "[be]": 1042,
      "[^^F,": 1043,
      "[B,-F,]": 1044,
      "[B,-_B,]": 1045,
      "[A,-A,,-]": 1046,
      "[F,-D,]": 1047,
      "[f'c']": 1048,
      "[D-A,]": 1049,
      "[_E": 1050,
      "[_a": 1051,
      "[G,-E,]": 1052,
      "[G,-B,,]": 1053,
      "[E-B,]": 1054,
      "[^A,=A,]": 1055,
      "[G-D]": 1056,
      "[e-_e]": 1057,
      "[b-d]": 1058,
      "^^F]": 1059,
      "[A-C]": 1060,
      "[^d^": 1061,
      "[C,-B,,]": 1062,
      "[^ed]": 1063,
      "[^GF]": 1064,
      "[^G=G-]": 1065,
      "[^F=F]": 1066,
      "[^F=F-]": 1067,
      "[^B=B]": 1068,
      "[=B_B]": 1069,
      "[^^CC]": 1070,
      "[f=e]": 1071,
      "[d-=d]": 1072,
      "=e": 1073,
      "=D,]": 1074,
      "=B,,-]": 1075,
      "=E,-]": 1076,
      "=G,-]": 1077,
      "=A,-]": 1078,
      "=B,-]": 1079,
      "=b-]": 1080,
      "BAF]": 1081,
      "DA,]": 1082,
      "EB,]": 1083,
      "^G": 1084,
      "^C,]": 1085,
      "^B,,]": 1086,
      "^e]": 1087,
      "^B,,-]": 1088,
      "^G-]": 1089,
      "_E,]": 1090,
      "_B,-]": 1091,
      ",-C,-]": 1092,
      "[^C,": 1093,
      "[^D-": 1094,
      "[^D,-": 1095,
      "A,E,]": 1096,
      "[G-^": 1097,
      "[EE]": 1098,
      "[EE,-]": 1099,
      "[E-^": 1100,
      "[EB,-]": 1101,
      "[EF,-A,,]": 1102,
      "[EB,G,]": 1103,
      "[C=B,]": 1104,
      "[D^": 1105,
      "[DA,D,]": 1106,
      "[DA,F,]": 1107,
      "[cD]": 1108,
      "[dG-]": 1109,
      "[dBG]": 1110,
      "[d^c]": 1111,
      "[eF]": 1112,
      "[ecA]": 1113,
      "[B,=A,]": 1114,
      "[B=A]": 1115,
      "[B^A]": 1116,
      "[gc-]": 1117,
      "[AA,-]": 1118,
      "[AFC]": 1119,
      "[ad-]": 1120,
      "[A,E,,]": 1121,
      "[A,B,,E,,]": 1122,
      "[A,C,F,,]": 1123,
      "[A,,-D,,-]": 1124,
      "[=F": 1125,
      "[=c": 1126,
      "[=F,-": 1127,
      "[=A,-": 1128,
      "[=E,-": 1129,
      "[=D-": 1130,
      "[=F-": 1131,
      "[=G-": 1132,
      "[G,B,,]": 1133,
      "[F,A,,D,,]": 1134,
      "G,D,]": 1135,
      "G,C,-]": 1136,
      "[E,C,]": 1137,
      "[E,G,,]": 1138,
      "[d'-^": 1139,
      "[D,B,,]": 1140,
      "[bc]": 1141,
      "[bge]": 1142,
      "[^^d": 1143,
      "[C,B,,-]": 1144,
      "[C,F,,]": 1145,
      "E,B,,-]": 1146,
      "D,A,,-]": 1147,
      "[B,-D,]": 1148,
      "[B,-E,]": 1149,
      "[B,-C,]": 1150,
      "[B,-B,,-]": 1151,
      "[C-G,]": 1152,
      "[C-=C]": 1153,
      "[C-D,-G,,]": 1154,
      "[A,-C,]": 1155,
      "[A,-C,-": 1156,
      "[A,-B,,E,,]": 1157,
      "[F,-=F,]": 1158,
      "[D-G,]": 1159,
      "[D-D,]": 1160,
      "[D-E,]": 1161,
      "[D-F,-]": 1162,
      "C,G,,-]": 1163,
      "[G,-G,,-]": 1164,
      "[G,-E,-": 1165,
      "[G,-=G,]": 1166,
      "[E,-B,,-": 1167,
      "[E,-C,,-]": 1168,
      "[E,-A,,": 1169,
      "[E-F,]": 1170,
      "[E-A,]": 1171,
      "[E-A,-": 1172,
      "[E-A,-C,]": 1173,
      "-=e]": 1174,
      "[G-C-": 1175,
      "[G-A,-D,]": 1176,
      "[B-_B]": 1177,
      "[a-f]": 1178,
      "[F-B,-D,]": 1179,
      "[d-F-": 1180,
      "[c-E-A,]": 1181,
      "[A-B,-E,]": 1182,
      "[^d'": 1183,
      "[B,,E,,]": 1184,
      "[=B,_B,]": 1185,
      "E,-A,,]": 1186,
      "E,-G,,]": 1187,
      "[^c=c-]": 1188,
      "[=A,F,-]": 1189,
      "[^C=C]": 1190,
      "[^FE]": 1191,
      "[^AG]": 1192,
      "-^^C]": 1193,
      "-^^F]": 1194,
      "[^D=D-]": 1195,
      "[^E=E]": 1196,
      "[EDG,-]": 1197,
      "[^^F^F]": 1198,
      "[C^B,]": 1199,
      "[B,^A,]": 1200,
      "[FEG,-C,-]": 1201,
      "[^^c'^c']": 1202,
      "[AGB,-E,-]": 1203,
      "[CB,D,-G,,-]": 1204,
      "[=gf]": 1205,
      "[g-=g]": 1206,
      "[B-D-G,]": 1207,
      "[A,-C,-F,,]": 1208,
      "[E,-B,,-C,,]": 1209,
      "[E,-A,,C,,-]": 1210,
      ",F,,]": 1211,
      "-f]": 1212,
      "=A,,]": 1213,
      "=a-]": 1214,
      "EG,]": 1215,
      "[f=f]": 1216,
      "[ac]": 1217,
      "^d]": 1218,
      "^D-]": 1219,
      "_D-]": 1220,
      "_A-]": 1221,
      "_e-]": 1222,
      "dcA]": 1223,
      "[^C-": 1224,
      "[^ba]": 1225,
      "A,E,-]": 1226,
      "[F=E]": 1227,
      "[G^F]": 1228,
      "[G=F]": 1229,
      "[DA,-]": 1230,
      "[cAF]": 1231,
      "[c=B]": 1232,
      "[d=d]": 1233,
      "[e=e]": 1234,
      "[BB]": 1235,
      "[BC-]": 1236,
      "[gA]": 1237,
      "[g=g]": 1238,
      "[AA]": 1239,
      "[A^G]": 1240,
      "[ae": 1241,
      "[ad]": 1242,
      "[af-]": 1243,
      "[=f": 1244,
      "[G,,F,,]": 1245,
      "[F,F,,]": 1246,
      "[ff]": 1247,
      "[f^f]": 1248,
      "G,D,-]": 1249,
      "[c'g]": 1250,
      "[E,^D,]": 1251,
      "[d'^": 1252,
      "[d'a]": 1253,
      "[d'b-]": 1254,
      "[D,A,,-]": 1255,
      "[D,G,,]": 1256,
      "F,D,]": 1257,
      "[^^D": 1258,
      "[e'c']": 1259,
      "[e'c'-]": 1260,
      "[B,-^A,]": 1261,
      "[C-C,]": 1262,
      "[C-A,-": 1263,
      "[A,-=A,]": 1264,
      "[A,-^G,]": 1265,
      "[F,-D,-": 1266,
      "[_G,-": 1267,
      "[_B,-": 1268,
      "[_D-": 1269,
      "[_E-": 1270,
      "[g-e]": 1271,
      "[G-G,]": 1272,
      "[B-E-": 1273,
      "G,-B,,]": 1274,
      "[d-F]": 1275,
      "[c-E]": 1276,
      "[b-_b]": 1277,
      "^^f-]": 1278,
      "[A-E]": 1279,
      "[B,,A,,-]": 1280,
      "[^cc]": 1281,
      "[=eBG]": 1282,
      "[=A,G,]": 1283,
      "[^C=C-]": 1284,
      "[d'-f]": 1285,
      "[^gdB]": 1286,
      "[^aec]": 1287,
      "[=b-": 1288,
      "[=bfd]": 1289,
      "[^B,=B,]": 1290,
      "[^A=A-]": 1291,
      "-^^c]": 1292,
      "[^DC]": 1293,
      "[^bfd]": 1294,
      "[c'a-]": 1295,
      "[=E_E]": 1296,
      "[^BA]": 1297,
      "[^B=B-]": 1298,
      "[^G,E,-]": 1299,
      "[^E=E-]": 1300,
      "[=BA]": 1301,
      "[=B_B-]": 1302,
      "[=AG]": 1303,
      "[^^F^F-]": 1304,
      "[^fcA]": 1305,
      "[g-^^f]": 1306,
      "[=E,C,-]": 1307,
      "[c^B]": 1308,
      "[c^A-]": 1309,
      "[^^c^c]": 1310,
      "[c-^G-]": 1311,
      "[f-^e]": 1312,
      "[C-^B,]": 1313,
      "[a-^g]": 1314,
      "[^E,C,-]": 1315,
      "[c-=c]": 1316,
      "[c'-^b]": 1317,
      "[b-^a]": 1318,
      "[^C,A,,-]": 1319,
      "'-]": 1320,
      "-g]": 1321,
      "-a']": 1322,
      "=A": 1323,
      "=B,,]": 1324,
      "=D,-]": 1325,
      "=e-]": 1326,
      "CG,]": 1327,
      "DF,B,,]": 1328,
      "EG,C,]": 1329,
      "FA,]": 1330,
      "GB,]": 1331,
      "^B,]": 1332,
      "^A,,-]": 1333,
      "^E-]": 1334,
      "^e-]": 1335,
      "_G,]": 1336,
      "_D]": 1337,
      "bg": 1338,
      "cF-]": 1339,
      "cBG]": 1340,
      "f-": 1341,
      "g-": 1342,
      "fec]": 1343,
      "B,,-G,,-]": 1344,
      "B,,G,,]": 1345,
      "[FD-]": 1346,
      "[FA,-D,-]": 1347,
      "[F_E-]": 1348,
      "[FG,-B,,]": 1349,
      "[GG]": 1350,
      "[GD,]": 1351,
      "[GD,-]": 1352,
      "[GB,-": 1353,
      "[GA,D,]": 1354,
      "[G=F-]": 1355,
      "[G^^F]": 1356,
      "[GEB,]": 1357,
      "[EB,,]": 1358,
      "[EB,,-]": 1359,
      "[EG,-": 1360,
      "[EF,B,,]": 1361,
      "[EF,-B,,-]": 1362,
      "[E_D-]": 1363,
      "[C=": 1364,
      "[CB,-": 1365,
      "[CE,-A,,-]": 1366,
      "[CG,C,]": 1367,
      "[CD,-G,,-]": 1368,
      "[CA,F,]": 1369,
      "[DA,,]": 1370,
      "[DA,,-]": 1371,
      "[DF,-": 1372,
      "[DE,A,,]": 1373,
      "[DF,-B,,-]": 1374,
      "[DE,-A,,-]": 1375,
      "[D=D]": 1376,
      "[D=C-]": 1377,
      "[D-^^C]": 1378,
      "[c=c]": 1379,
      "[d_": 1380,
      "[dd]": 1381,
      "[dE-G,]": 1382,
      "[d^^c]": 1383,
      "[dcF-]": 1384,
      "[eB": 1385,
      "[ee]": 1386,
      "[e=d]": 1387,
      "[B,^^": 1388,
      "[B,,-G,,-]": 1389,
      "[B,F,,]": 1390,
      "[B,F,B,,]": 1391,
      "[B,C,F,,]": 1392,
      "[BF,-]": 1393,
      "[BG-]": 1394,
      "[BD-": 1395,
      "[B=B]": 1396,
      "[B_B]": 1397,
      "[BC-E,]": 1398,
      "[BDG,]": 1399,
      "[BEG,C,]": 1400,
      "[gd": 1401,
      "[gG]": 1402,
      "[ge-]": 1403,
      "[g^f]": 1404,
      "[g^g]": 1405,
      "[AF-]": 1406,
      "[AC-": 1407,
      "[AC-F,-]": 1408,
      "[AB,-D,]": 1409,
      "[A=G-]": 1410,
      "[ADF,B,,]": 1411,
      "[aA]": 1412,
      "[aa]": 1413,
      "[afd]": 1414,
      "[a^g]": 1415,
      "[A,A,,-]": 1416,
      "[A,E,A,,]": 1417,
      "[A,=A,]": 1418,
      "[A,,-A,,-]": 1419,
      "[A,B,,-E,,-]": 1420,
      "[=c'": 1421,
      "[=C-": 1422,
      "[=C,C,]": 1423,
      "[=B,-": 1424,
      "[=C,-": 1425,
      "[=fe]": 1426,
      "[=c-": 1427,
      "[G,F,": 1428,
      "[G,E,": 1429,
      "[G,F,-": 1430,
      "[G,A,,-D,,-]": 1431,
      "[F,D,": 1432,
      "[F,G,,-]": 1433,
      "[F,E,-": 1434,
      "[F,C,F,,]": 1435,
      "[fc": 1436,
      "[fd-]": 1437,
      "[c'd]": 1438,
      "[E,C,": 1439,
      "[E,E,,]": 1440,
      "[E,D,-": 1441,
      "[E,=A,,]": 1442,
      "[d'g-]": 1443,
      "[D,A,,]": 1444,
      "[D,G,,-]": 1445,
      "[D,C,-": 1446,
      "[D,B,,G,,]": 1447,
      "F,B,,-]": 1448,
      "[b-=": 1449,
      "[C,A,,]": 1450,
      "[C,A,,-]": 1451,
      "[C,G,,]": 1452,
      "E,A,,-]": 1453,
      "E,G,,-]": 1454,
      "D,F,,-]": 1455,
      "[B,-B,,]": 1456,
      "[B,-F,-]": 1457,
      "[B,-G,,]": 1458,
      "[B,-G,,-]": 1459,
      "[B,-F,-": 1460,
      "[B,-F,-B,,-]": 1461,
      "[B,-C,F,,]": 1462,
      "[B,-D,-G,,]": 1463,
      "[B,-E,-G,,]": 1464,
      "[B,-E,G,,-]": 1465,
      "[C-A,": 1466,
      "[C-C,-]": 1467,
      "[C-A,,]": 1468,
      "[C-E,-A,,-]": 1469,
      "[C-=B,]": 1470,
      "[A,-E,]": 1471,
      "[A,-E,-]": 1472,
      "[A,-F,-": 1473,
      "[A,-E,-": 1474,
      "[A,-F,,-]": 1475,
      "[A,-E,-A,,-]": 1476,
      "[A,-C,-F,,-]": 1477,
      "[A,-D,F,,-]": 1478,
      "[F,-F,,-]": 1479,
      "[F,-C,-": 1480,
      "[F,-B,,": 1481,
      "[F,-D,,-]": 1482,
      "[F,-C,-F,,-]": 1483,
      "[F,-=A,,-]": 1484,
      "[D-B,,]": 1485,
      "[D-B,,-]": 1486,
      "[D-E,A,,]": 1487,
      "[D-F,-B,,-]": 1488,
      "[D-=D]": 1489,
      "[D-A,-D,-]": 1490,
      "[D-G,B,,-]": 1491,
      "[D-E,-A,,]": 1492,
      "[_b": 1493,
      "[_g": 1494,
      "[_d'": 1495,
      "[_E,E,]": 1496,
      "[_c-": 1497,
      "[_G-": 1498,
      "[_B-": 1499,
      "[_D-E,]": 1500,
      "[_A-": 1501,
      "[G,-D,-]": 1502,
      "[G,-B,,-E,,-]": 1503,
      "[E,-C,-": 1504,
      "[E,-E,,-]": 1505,
      "[E-E,]": 1506,
      "[E-E,-]": 1507,
      "[E-G,-]": 1508,
      "[E-F,B,,]": 1509,
      "[E-G,-C,-]": 1510,
      "[^A,=A,-]": 1511,
      "[g-e": 1512,
      "[G-C]": 1513,
      "[G-A,]": 1514,
      "[G-A,D,]": 1515,
      "[G-D-E,]": 1516,
      "[B-G-]": 1517,
      "[B-F-": 1518,
      "[B-E-G,]": 1519,
      "[F-D": 1520,
      "[F-F,-]": 1521,
      "[F-B,-]": 1522,
      "[F-C-": 1523,
      "[d-B-]": 1524,
      "[d-E-A,]": 1525,
      "[c-A-]": 1526,
      "[b-g": 1527,
      "[b-g]": 1528,
      "^^g]": 1529,
      "^^F-]": 1530,
      "[A-A,]": 1531,
      "[C,-A,,-]": 1532,
      "[B,,G,,]": 1533,
      "[B,,G,,-]": 1534,
      "[=B,A,]": 1535,
      "[^c-": 1536,
      "[^cG]": 1537,
      "[^c^A]": 1538,
      "[^c^G": 1539,
      "[=A,C,-]": 1540,
      "[=A,,-C,,-]": 1541,
      "[^C,-C,-]": 1542,
      "[^e^": 1543,
      "[d'-b]": 1544,
      "[d'-a]": 1545,
      "[e'-g]": 1546,
      "[D,-B,,-]": 1547,
      "[D,-B,,-G,,-]": 1548,
      "[^AG-]": 1549,
      "[=a_a]": 1550,
      "-^^G]": 1551,
      "[^b-": 1552,
      "[=ED]": 1553,
      "[^G,B,,-]": 1554,
      "[EDF,B,,]": 1555,
      "[BAD-]": 1556,
      "[BACF,]": 1557,
      "[=A-": 1558,
      "[DCE,A,,]": 1559,
      "[^^C^C]": 1560,
      "[GFA,D,]": 1561,
      "[f^e]": 1562,
      "[f^d-]": 1563,
      "[=E,B,,]": 1564,
      "[^F,B,,-]": 1565,
      "[FEA,-]": 1566,
      "[f-=e]": 1567,
      "[b'-a']": 1568,
      "[D-G,-B,,-E,,-]": 1569,
      "[GCE,A,,]": 1570,
      "[EA,C,F,,]": 1571,
      "[DG,B,,E,,]": 1572,
      "[e^d]": 1573,
      "[AGC-]": 1574,
      "[C-^A,]": 1575,
      "[=G,-G,-]": 1576,
      "[F^E]": 1577,
      "[A,=B,,]": 1578,
      "[=GF]": 1579,
      "[=D,-D,-]": 1580,
      "[=D,-C,G,,-]": 1581,
      "[_D=E,]": 1582,
      "[=D,B,,-]": 1583,
      "[=D,G,,-]": 1584,
      "[^D,B,,-]": 1585,
      "[^F,-F,-]": 1586,
      "[D-^C]": 1587,
      "[A_G]": 1588,
      "[A_G-]": 1589,
      "[A-^G]": 1590,
      "[c'-=b]": 1591,
      "[A-D-F,-B,,-]": 1592,
      "[A-=A]": 1593,
      "[^D,-D,-]": 1594,
      "[=F,-F,-]": 1595,
      "[=E,-E,-]": 1596,
      "[d'-^c']": 1597,
      "[G,-E,-C,-]": 1598,
      "[E-A,-C,-F,,-]": 1599,
      "[G-C-E,-A,,-]": 1600,
      "[d-F-B,]": 1601,
      "[C-A,-F,-]": 1602,
      "[F,-D,-B,,-]": 1603,
      "[_G,-=A,,-]": 1604,
      "[_D-E,A,,]": 1605,
      "[B-E-G,-C,-]": 1606,
      "[GB,-D,-]": 1607,
      "[EG,-B,,-]": 1608,
      "[CB,-F,]": 1609,
      "[DF,-A,,-]": 1610,
      "[BD-F,-]": 1611,
      "[AC-E,-]": 1612,
      "[=C,-C,-]": 1613,
      "[G,E,C,]": 1614,
      "[G,F,-C,]": 1615,
      "[F,D,B,,]": 1616,
      "[F,E,-B,,]": 1617,
      "[E,C,A,,]": 1618,
      "[E,D,-A,,]": 1619,
      "[D,C,-G,,]": 1620,
      "[B,-F,-G,,]": 1621,
      "[A,-E,-F,,]": 1622,
      "[F,-C,-D,,]": 1623,
      "[F,-B,,D,,-]": 1624,
      "[E,-C,-A,,-]": 1625,
      "[B-F-G,]": 1626,
      "[F-C-D,]": 1627,
      "#m]": 1628,
      "'=": 1629,
      "-e]": 1630,
      "-c']": 1631,
      "-B-]": 1632,
      "-f-]": 1633,
      "=g-]": 1634,
      "=BAF]": 1635,
      "CF,-]": 1636,
      "^e": 1637,
      "^B]": 1638,
      "^E]": 1639,
      "^F,-]": 1640,
      "^A,,]": 1641,
      "_C]": 1642,
      "_A,-]": 1643,
      "_F-]": 1644,
      "f^": 1645,
      "fe-]": 1646,
      "f=d]": 1647,
      "B,F,]": 1648,
      "B,E,-]": 1649,
      "[^E-": 1650,
      "[^fc]": 1651,
      "[FF]": 1652,
      "[GG,]": 1653,
      "[G-=": 1654,
      "[GE-]": 1655,
      "[G-^^F]": 1656,
      "[G_F-]": 1657,
      "[E=E]": 1658,
      "[E=D-]": 1659,
      "[C=C]": 1660,
      "[CG,E,]": 1661,
      "[D^^": 1662,
      "[D^C]": 1663,
      "[K:B]": 1664,
      "[cc]": 1665,
      "[c^c]": 1666,
      "[c_B-]": 1667,
      "[dD]": 1668,
      "[d=B-]": 1669,
      "[eE]": 1670,
      "[e=d-]": 1671,
      "[e_d]": 1672,
      "[e-=e]": 1673,
      "[B,=": 1674,
      "[B,_B,]": 1675,
      "[BB,]": 1676,
      "[B=A-]": 1677,
      "[B_A-]": 1678,
      "[gg]": 1679,
      "[g^^f]": 1680,
      "[g^e-]": 1681,
      "[A=G]": 1682,
      "[a^": 1683,
      "[a^f]": 1684,
      "[a^f-]": 1685,
      "[a^^f-]": 1686,
      "[A,^^": 1687,
      "[=G,B,,-]": 1688,
      "[=G,C,-]": 1689,
      "[G,^": 1690,
      "[F,=E,]": 1691,
      "[F,^D,]": 1692,
      "[F,^E,]": 1693,
      "[fF]": 1694,
      "[f-^^": 1695,
      "[f_e]": 1696,
      "G,^": 1697,
      "[c'af]": 1698,
      "[c'=b]": 1699,
      "[bb]": 1700,
      "[bg-]": 1701,
      "[b^g]": 1702,
      "[b=a]": 1703,
      "[^^fe]": 1704,
      "[C,C,,]": 1705,
      "[C-F,]": 1706,
      "[C-D,]": 1707,
      "[A,-F,-]": 1708,
      "[A,-_A,]": 1709,
      "[F,-A,,]": 1710,
      "[D-B,": 1711,
      "[_A": 1712,
      "[_B": 1713,
      "[_F": 1714,
      "[_G": 1715,
      "[_c": 1716,
      "[_e": 1717,
      "[_A,": 1718,
      "[_A,-": 1719,
      "[_e'": 1720,
      "[G,-D,]": 1721,
      "[G,-E,-]": 1722,
      "[G,-^^F,]": 1723,
      "[E,-^D,]": 1724,
      "[E,-_E,]": 1725,
      "[E-C": 1726,
      "[E-B,-]": 1727,
      "[^A,C,-]": 1728,
      "[g-e-]": 1729,
      "[G-E": 1730,
      "[G-E,]": 1731,
      "[e-c]": 1732,
      "[f-d]": 1733,
      "[f-B]": 1734,
      "[a-d]": 1735,
      "[a-f-]": 1736,
      "[F-C-]": 1737,
      "[F-B,-": 1738,
      "^^c-]": 1739,
      "[A-F,]": 1740,
      "[^dd]": 1741,
      "[^dA]": 1742,
      "[^dAF]": 1743,
      "[^d=d-]": 1744,
      "[c'-a": 1745,
      "[c'-a]": 1746,
      "[=B,E,-]": 1747,
      "[=B,G,-]": 1748,
      "[=B,_B,-]": 1749,
      "[=e_e-]": 1750,
      "[=A,D,-]": 1751,
      "[^CB,]": 1752,
      "[^CF,-]": 1753,
      "[^CE,-]": 1754,
      "[^eB]": 1755,
      "[^ee]": 1756,
      "[^gg]": 1757,
      "[^ae]": 1758,
      "[=bf]": 1759,
      "[e'-c']": 1760,
      "[^^ff]": 1761,
      "[^^fcA]": 1762,
      "[^G-": 1763,
      "[^F-": 1764,
      "[^B,=B,-]": 1765,
      "[^AA]": 1766,
      "[=ae]": 1767,
      "-^^D]": 1768,
      "[=d_d]": 1769,
      "[=E_E-]": 1770,
      "[^G,C,-]": 1771,
      "[^G,=G,-]": 1772,
      "[^c'b]": 1773,
      "[^c'ge]": 1774,
      "[=A_A]": 1775,
      "[C^A,-]": 1776,
      "[g-^g]": 1777,
      "[^^C^C-]": 1778,
      "c-A-]": 1779,
      "[f^d]": 1780,
      "[f^e-]": 1781,
      "[^^cB]": 1782,
      "[^^c'ge]": 1783,
      "[c-^B]": 1784,
      "[e^c-]": 1785,
      "[e^d-]": 1786,
      "[f-^f]": 1787,
      "[a-^e-]": 1788,
      "[F^D-]": 1789,
      "[F-=F]": 1790,
      "[F-=E]": 1791,
      "[d^B-]": 1792,
      "[d-^c]": 1793,
      "[d-^A-]": 1794,
      "[b^a]": 1795,
      "[b^g-]": 1796,
      "[B-=B]": 1797,
      "[=d'c']": 1798,
      "[c'-=c']": 1799,
      "[^^G^G]": 1800,
      "[=e'd']": 1801,
      "d-BG]": 1802,
      "[e-^d]": 1803,
      "[e-^B-]": 1804,
      "[a-=a]": 1805,
      "[a-=e-]": 1806,
      "=edB]": 1807,
      "[E-^D]": 1808,
      "[^d'c']": 1809,
      "[d_c-]": 1810,
      "[^c-A-]": 1811,
      "'^": 1812,
      ",^": 1813,
      ",D,,]": 1814,
      ",C,,]": 1815,
      "-d]": 1816,
      "-c]": 1817,
      "-A]": 1818,
      "-G-]": 1819,
      "-c-]": 1820,
      "-cA]": 1821,
      "-d-]": 1822,
      "-A-": 1823,
      "2C": 1824,
      "2B,": 1825,
      "=B": 1826,
      "=D": 1827,
      "=a": 1828,
      "=f]": 1829,
      "=F,-]": 1830,
      "AF,]": 1831,
      "AGE]": 1832,
      "BG-]": 1833,
      "BE-]": 1834,
      "B,-G,,-]": 1835,
      "CE,]": 1836,
      "CA,,]": 1837,
      "CG,-]": 1838,
      "C-=": 1839,
      "DB,,]": 1840,
      "DB,G,]": 1841,
      "E,-G,,-]": 1842,
      "ECA,]": 1843,
      "FD,]": 1844,
      "F-^": 1845,
      "GE,]": 1846,
      "G^D]": 1847,
      "^c": 1848,
      "^d": 1849,
      "^D,": 1850,
      "^c-]": 1851,
      "^c'-]": 1852,
      "^BAF]": 1853,
      "^C,G,,-]": 1854,
      "_G]": 1855,
      "_C-]": 1856,
      "_d-]": 1857,
      "_b-]": 1858,
      "afec]": 1859,
      "b^g]": 1860,
      "cA-]": 1861,
      "dB-]": 1862,
      "ecBG]": 1863,
      "fB]": 1864,
      "fdcA]": 1865,
      "f'-]": 1866,
      "fcA-]": 1867,
      "ge-]": 1868,
      "g'-]": 1869,
      "[V:3Program16": 1870,
      "f=f-]": 1871,
      "baf]": 1872,
      "bass]": 1873,
      ",-B,,-]": 1874,
      ",-D,-]": 1875,
      ",-E,,-]": 1876,
      "B,C,]": 1877,
      "B,G,,]": 1878,
      "B,D,G,,]": 1879,
      "B,G,E,]": 1880,
      "[^B,-": 1881,
      "[^GE]": 1882,
      "[^C-E,]": 1883,
      "[^B,-D,]": 1884,
      "[^A,-C,]": 1885,
      "[^f=f-]": 1886,
      "A,^": 1887,
      "A,B,,]": 1888,
      "A,F,": 1889,
      "A,F,D,]": 1890,
      "[F=": 1891,
      "[F_": 1892,
      "[FC,]": 1893,
      "[FC,-]": 1894,
      "[FA,-": 1895,
      "[FE-": 1896,
      "[FG,C,]": 1897,
      "[F^G,]": 1898,
      "[FCF,]": 1899,
      "[F^F]": 1900,
      "[F^D]": 1901,
      "[F=F]": 1902,
      "[F=E-]": 1903,
      "[FDA,]": 1904,
      "[F-^^D]": 1905,
      "[FB,D,G,,]": 1906,
      "[GD-]": 1907,
      "[G=A,]": 1908,
      "[G=E]": 1909,
      "[GF-": 1910,
      "[G^D]": 1911,
      "[G=G]": 1912,
      "[GA,-C,]": 1913,
      "[GDG,]": 1914,
      "[G^F-]": 1915,
      "[G^A,]": 1916,
      "[GB,-E,-]": 1917,
      "[G^E-]": 1918,
      "[GB,G,,]": 1919,
      "[E^": 1920,
      "[E^^": 1921,
      "[E=D]": 1922,
      "[EG,-C,-]": 1923,
      "[E^C]": 1924,
      "[E_E]": 1925,
      "[E^F,]": 1926,
      "[E^^F,]": 1927,
      "[E^C-]": 1928,
      "[E-^^C]": 1929,
      "[E^D-]": 1930,
      "[E=D": 1931,
      "[C_": 1932,
      "[CG,,]": 1933,
      "[CG,,-]": 1934,
      "[C^^": 1935,
      "[CD,G,,]": 1936,
      "[C_B,-]": 1937,
      "[C_G,]": 1938,
      "[CE,-G,,-]": 1939,
      "[D=B,]": 1940,
      "[D^G,]": 1941,
      "[D=E,]": 1942,
      "[D=G,]": 1943,
      "[D^E,]": 1944,
      "[D=B,-]": 1945,
      "[D_C-]": 1946,
      "[cG": 1947,
      "[cC]": 1948,
      "[cD-]": 1949,
      "[cG-]": 1950,
      "[cD-": 1951,
      "[c=A]": 1952,
      "[c=D]": 1953,
      "[c_B]": 1954,
      "[c^D]": 1955,
      "[c=B-]": 1956,
      "[cFA,]": 1957,
      "[cBE-]": 1958,
      "[K:Db]": 1959,
      "[K:Em]": 1960,
      "[dA": 1961,
      "[d=B]": 1962,
      "[d=E]": 1963,
      "[d=c]": 1964,
      "[dc-": 1965,
      "[d-^^c]": 1966,
      "[dFD,]": 1967,
      "[e-=": 1968,
      "[eG-]": 1969,
      "[ec-]": 1970,
      "[e_e]": 1971,
      "[e^c]": 1972,
      "[e^F]": 1973,
      "[ed-": 1974,
      "[e^^c-]": 1975,
      "[eGE,]": 1976,
      "[B,A,-": 1977,
      "[B,=B,]": 1978,
      "[B,^G,]": 1979,
      "[B,=E,]": 1980,
      "[B,D,-G,,-]": 1981,
      "[B,=G,]": 1982,
      "[B,G,E,]": 1983,
      "[B,C,-F,,-]": 1984,
      "[B,_A,-]": 1985,
      "[BF-]": 1986,
      "[B^^": 1987,
      "[B^C]": 1988,
      "[B_A]": 1989,
      "[B^G-]": 1990,
      "[B-^^G]": 1991,
      "[BDB,,]": 1992,
      "[BF-^": 1993,
      "[ge": 1994,
      "[gB-]": 1995,
      "[g=e]": 1996,
      "[gd-BG]": 1997,
      "[AE,-]": 1998,
      "[A=B,]": 1999
    },
    "merges": [
      [
        "V",
        ":"
      ],
      [
        "[",
        "V:"
      ],
      [
        "m",
        "a"
      ],
      [
        "f",
        "e"
      ],
      [
        "!",
        "fe"
      ],
      [
        "a",
        "!"
      ],
      [
        "r",
        "ma"
      ],
      [
        "t",
        "a!"
      ],
      [
        "!fe",
        "rma"
      ],
      [
        "!ferma",
        "ta!"
      ],
      [
        "4",
        "]"
      ],
      [
        "[V:",
        "1"
      ],
      [
        "[V:",
        "2"
      ],
      [
        "[V:",
        "3"
      ],
      [
        "[V:1",
        "]"
      ],
      [
        "[V:2",
        "]"
      ],
      [
        "[V:3",
        "]"
      ],
      [
        "[V:",
        "4]"
      ],
      [
        "l",
        "e"
      ],
      [
        "f",
        "="
      ],
      [
        "c",
        "le"
      ],
      [
        "cle",
        "f="
      ],
      [
        "<",
        "|"
      ],
      [
        "|",
        ">"
      ],
      [
        "b",
        "le"
      ],
      [
        "e",
        "ble"
      ],
      [
        "r",
        "eble"
      ],
      [
        "t",
        "reble"
      ],
      [
        "clef=",
        "treble"
      ],
      [
        "o",
        "s"
      ],
      [
        "<|",
        "b"
      ],
      [
        "os",
        "|>"
      ],
      [
        "clef=treble",
        "]"
      ],
      [
        "K",
        ":"
      ],
      [
        "[",
        "K:"
      ],
      [
        "8",
        "]"
      ],
      [
        "M",
        ":"
      ],
      [
        "[",
        "M:"
      ],
      [
        ",",
        "]"
      ],
      [
        "j",
        "]"
      ],
      [
        "ma",
        "j]"
      ],
      [
        "a",
        "c"
      ],
      [
        "e",
        "os|>"
      ],
      [
        "h",
        "|>"
      ],
      [
        "<|",
        "eos|>"
      ],
      [
        "<|b",
        "os|>"
      ],
      [
        "<|b",
        "ac"
      ],
      [
        "<|bac",
        "h|>"
      ],
      [
        "1",
        "/"
      ],
      [
        ":",
        "1/"
      ],
      [
        "L",
        ":1/"
      ],
      [
        "[",
        "L:1/"
      ],
      [
        "C",
        "]"
      ],
      [
        "b",
        "a"
      ],
      [
        "s",
        "s"
      ],
      [
        "ba",
        "ss"
      ],
      [
        "clef=",
        "bass"
      ],
      [
        "-",
        "8]"
      ],
      [
        "4",
        "clef=bass"
      ],
      [
        "[V:",
        "4clef=bass"
      ],
      [
        "[V:1",
        "clef=treble]"
      ],
      [
        "[V:2",
        "clef=treble]"
      ],
      [
        "[V:3",
        "clef=treble"
      ],
      [
        "[V:4clef=bass",
        "]"
      ],
      [
        "[V:3clef=treble",
        "-8]"
      ],
      [
        "[M:",
        "C]"
      ],
      [
        ",",
        "-"
      ],
      [
        "[L:1/",
        "4]"
      ],
      [
        ",-",
        "]"
      ],
      [
        "[L:1/",
        "8]"
      ],
      [
        "b",
        "maj]"
      ],
      [
        "B",
        ","
      ],
      [
        "/",
        "4]"
      ],
      [
        "[",
        "^"
      ],
      [
        "A",
        ","
      ],
      [
        "[",
        "F"
      ],
      [
        "[",
        "G"
      ],
      [
        "-",
        "]"
      ],
      [
        "[",
        "E"
      ],
      [
        "[",
        "C"
      ],
      [
        "[",
        "D"
      ],
      [
        "[K:",
        "B"
      ],
      [
        "[K:",
        "A"
      ],
      [
        "[",
        "c"
      ],
      [
        "[K:",
        "F"
      ],
      [
        "[K:",
        "D"
      ],
      [
        "[K:",
        "E"
      ],
      [
        "[M:",
        "3"
      ],
      [
        "[",
        "d"
      ],
      [
        "[M:3",
        "/4]"
      ],
      [
        "[",
        "e"
      ],
      [
        "F",
        ",]"
      ],
      [
        "[",
        "B,"
      ],
      [
        "[",
        "B"
      ],
      [
        "[",
        "g"
      ],
      [
        "G",
        ",]"
      ],
      [
        "[",
        "A"
      ],
      [
        "G",
        "]"
      ],
      [
        "f",
        "]"
      ],
      [
        "[",
        "a"
      ],
      [
        "[M:",
        "4"
      ],
      [
        "A",
        ",]"
      ],
      [
        "d",
        "]"
      ],
      [
        "D",
        ",]"
      ],
      [
        "E",
        ",]"
      ],
      [
        "'",
        "]"
      ],
      [
        "[M:4",
        "/4]"
      ],
      [
        "[",
        "A,"
      ],
      [
        "[",
        "="
      ],
      [
        "B",
        ",]"
      ],
      [
        "B",
        "]"
      ],
      [
        "[G",
        ","
      ],
      [
        "c",
        "]"
      ],
      [
        "[F",
        ","
      ],
      [
        "A",
        "]"
      ],
      [
        "C",
        ",]"
      ],
      [
        "[K:A",
        "bmaj]"
      ],
      [
        "b",
        "]"
      ],
      [
        "[K:E",
        "maj]"
      ],
      [
        "[",
        "f"
      ],
      [
        "[K:F",
        "#"
      ],
      [
        "[K:F#",
        "maj]"
      ],
      [
        "g",
        "]"
      ],
      [
        "[K:B",
        "maj]"
      ],
      [
        "[K:D",
        "bmaj]"
      ],
      [
        "[K:E",
        "bmaj]"
      ],
      [
        "G",
        ","
      ],
      [
        "[K:A",
        "maj]"
      ],
      [
        "[c",
        "'"
      ],
      [
        "[K:B",
        "bmaj]"
      ],
      [
        "[K:F",
        "maj]"
      ],
      [
        "[K:D",
        "maj]"
      ],
      [
        "[E",
        ","
      ],
      [
        "[K:",
        "G"
      ],
      [
        "[K:G",
        "maj]"
      ],
      [
        "F",
        "]"
      ],
      [
        "D",
        "]"
      ],
      [
        "B,",
        ",]"
      ],
      [
        "E",
        "]"
      ],
      [
        "[d",
        "'"
      ],
      [
        "[",
        "fe"
      ],
      [
        "e",
        "]"
      ],
      [
        "[K:",
        "C"
      ],
      [
        "[K:C",
        "maj]"
      ],
      [
        "[fe",
        "]"
      ],
      [
        "[g",
        "f]"
